{
  "symbol": "BBC",
  "last_updated": "2025-07-18T12:52:24.816715",
  "news": [
    {
      "title": "Share Trading Of RBCL & BBC Suspended",
      "link": "https://www.investopaper.com/news/share-trading-of-rbcl-bbc-suspended/",
      "date": "February 1, 2021",
      "summary": "Investopaper Nepal Stock Exchange (NEPSE) has stopped the trading of shares of two companies – Rastriya",
      "full_content": "Nepal Stock Exchange (NEPSE) has stopped the trading of shares of two companies – Rastriya Beema Company Limited (RBCL) and Bishal Bazar Company Limited (BBC).\n\nChief Executive Officer of the Nepal Stock Exchange Chandra Singh Saud informed that the share trading of these two companies was stopped due to non-compliance with the Securities Act.According to Saud, the two companies have not been able to submit their financial statements. These companies have not hold a general meeting for a long time. Government of Nepal has investment in both the companies.\n\nAs per the provision in the Securities Listing Rules, the listed organization has to submit the audited financial statement and audit report of each financial year within 5 months of the end of the financial year.\n\nRastriya Beema Company (RBCL) traded at Rs 16,670 while BBC was trading at Rs 2,880 on Sunday.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/04/TRADING-INVESTING-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Securities of 9 Companies Listed in NEPSE in Ashad",
      "link": "https://www.investopaper.com/news/shares-listing-monthwise/",
      "date": "July 18, 2025",
      "summary": "Investopaper The table below presents the new listing of shares in the month of Ashad, 2082",
      "full_content": "The table below presents the new listing of shares in the month of Ashad, 2082 BS.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/10/listing.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Top 10 Most Valuable Companies Listed in NEPSE [2025]",
      "link": "https://www.investopaper.com/news/top-10-companies-of-nepal-by-market-capitalization/",
      "date": "June 19, 2025",
      "summary": "Investopaper The table below shows the list of the top ten companies of Nepal based on",
      "full_content": "The table below shows the list of the top ten companies of Nepal based on market capitalization. We have included the companies listed and traded on Nepal Stock Exchange (NEPSE). Commercial Banks occupy 4 out of 10 spots in the highest market capitalization category.\n\nAll these ten companies have a market capitalization above Rs 70 billion.\n\nBishal Bazar Company Limited (BBC) is the most valued company with a market capitalization of Rs. 218.95 billion. Nepal Reinsurance Company Limited (NRIC) is second with a market value of Rs. 169.67 billion. Similarly, Nepal Doorsanchar Company Limited (NTC) is the third biggest company with a market cap of Rs 153.89 billion.\n\nAlso Read:\n\nTop 10 Commercial Banks In Nepal\n\nTop 5 Microfinance of Nepal\n\nSee the table below for the top 10 most valuable companies in Nepal.\n\nNote: The market capitalization is based on the share price of Jestha end, 2082 BS. At current, the share price, as well as market value, may vary.\n\nRead Related Contents:\n\nTop Life Insurance In Nepal\n\nTop Non-Life Insurance in Nepal\n\nShare This Via:",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/05/top-10-799x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Dividend Announcement by Development Banks of Nepal [FY 2080/81]",
      "link": "https://www.investopaper.com/news/dividend-announcement-by-development-banks-of-nepal/",
      "date": "December 24, 2024",
      "summary": "Investopaper The table below presents the dividend announced by the development banks (so far) listed on",
      "full_content": "The table below presents the dividend announced by the development banks (so far) listed on the Nepal Stock Exchange (NEPSE). The dividend declaration is from the fiscal year 2080/81.\n\nYou May Also Like:\n\nDividend Announcement By Commercial Banks Of Nepal\n\nDividend Announcement By Microfinance Companies Of Nepal (Updated)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/01/DIVIDEND-798x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Narayani Development Bank to Issue 1:1 Right Share | SEBON Gives Approval",
      "link": "https://www.investopaper.com/news/narayani-development-bank-right-share-issue/",
      "date": "January 7, 2024",
      "summary": "Investopaper Narayani Development Bank Limited (NABBC) is planning to sell right shares to the shareholders. For",
      "full_content": "Narayani Development Bank Limited (NABBC) is planning to sell right shares to the shareholders. For this purpose, Securities Board Of Nepal (SEBON) has given permission to the company on Poush 19, 2080 BS. The company had submitted the application to the board on Bhadra 9, 2079 BS for the right issuance.\n\nOnly after the approval from the regulatory body SEBON, the company can sell the right shares.\n\nNow, after the approval from SEBON, NABBC will issue the right shares in the ratio of 1:1. This means that, shareholders with 100 shares can apply for the additional 100 shares.\n\nAt present, NABBC has a paid up capital of Rs. 26.24 crores. Hence, the company has plans to sell 26,24,676 right shares worth Rs. 26.24 crores.\n\nAfter the right issue, NABBC will have a paid-up capital of Rs.  52.48 crores.\n\nThe company had approved the agenda of issuing right share in the ratio of 1:1 from its Special General Meeting (SGM) held on Ashad 8, 2079 BS.\n\nGlobal IME Capital Limited is the issue and sales manager for the right offering.\n\nPreviously, the company had sold 100 percent right shares from Poush 7 to Magh 12, 2078 BS.\n\nAlso Read:Narayani Development Bank 1:1 right share",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/09/right-share.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Top 10 Stocks with Highest Share Price in Nepal",
      "link": "https://www.investopaper.com/news/top-10-stocks-with-highest-share-price-in-nepal/",
      "date": "October 31, 2023",
      "summary": "Investopaper Here, we have presented the 10 stocks trading in Nepal Stock Exchange (NEPSE) that have",
      "full_content": "Here, we have presented the 10 stocks trading in Nepal Stock Exchange (NEPSE) that have the highest share price. The share price is taken from the website of the Nepal Stock Exchange dated October 30, 2023 [Karthik 14, 2080 BS].\n\nYou May Be Interested In:\n\nTop 10 Highest Dividend Paying Stocks In Nepal\n\n6 Financial Ratios To Look Into Before Investing In Stocks\n\nSuggestedReadings:\n\nTop 5 Non-Life Insurance in Nepal\n\nTop 5 Life Insurance In Nepal\n\nYou MayAlsoLike:\n\nBest Microfinance Companies In Nepal\n\nTop 10 Commercial Banks In Nepal\n\nAlso Read:\n\nMajor Factors Influencing The Share Market Of Nepal\n\n5 Golden Rules to be Successful in the Stock Market\n\nIn Nutshell, stocks with the highest share price in Nepal are:\n\nNote: The share price along with other information is as of the date October 30, 2023 [Karthik 14, 2080 BS]. At present, this information along with the ranking may vary.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/01/profit-growth-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Narayani Development Bank To Close Auction Of Unsold Right Shares On Chaitra 17",
      "link": "https://www.investopaper.com/news/narayani-development-bank-auction/",
      "date": "March 31, 2022",
      "summary": "Investopaper Narayani Development Bank Limited (NABBC)) is currently selling the unsold right shares in the auction.",
      "full_content": "Narayani Development Bank Limited (NABBC)) is currently selling the unsold right shares in the auction. The auction is open from Chaitra 10, 2078 BS. The shares in the auction include:\n\nPromoter Shares:131,998 units\n\nOrdinary Shares:13,651\n\nThe current promoter shareholders and other general public, firms, and companies can submit the application for the purchase of the shares. Interested investors can submit the bids until Chaitra 17, 2078 BS.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/06/auction-court-1-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Narayani Development Bank To Close 1:1 Right Share On Magh 12",
      "link": "https://www.investopaper.com/news/narayani-development-bank-right-issue/",
      "date": "January 26, 2022",
      "summary": "Investopaper After the previous issue of 1:1 right share, Narayani Development Bank Limited (NABBC) is currently",
      "full_content": "After the previous issue of1:1 right share, Narayani Development Bank Limited (NABBC) is currently selling the right shares to its shareholders from Poush 7, 2078 BS. The company will close on the right issue on Magh 12, 2078 BS. Previously, the right issue was set to close on Poush 27, 2078 BS. However, only 19 percent of the right share was subscribed during that period.\n\nNABBC closed the shareholders’ registration book on Mangsir 24, 2078 BS. Therefore, the investors purchasing the shares of NABBC until Mangsir 23 will be eligible to apply for the right shares.\n\nThe company is issuing the right share in the ratio of 1:1. As of Ashad’s end 2078 BS, the development bank has a paid-up capital of Rs 13.12 crores. Hence, the company will float 1,312,338 shares in the right offering that amounts to Rs 13.12 crores.\n\nSecurities Board Of Nepal (SEBON) had granted approval to the company on Mangsir 3, 2078 to issue the right shares. The company had submitted an application to SEBON on Ashad 4, 2078 BS for the right issuance.\n\nGlobal IME Capital Limited has been appointed as the issue manager for the public issue.\n\nAfter the right issue, the capital of Narayani Development Bank will rise to Rs 26.24 crores (if fully subscribed).",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/09/right-share.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Bishal Bazar Company Appoints Prabhu Capital as Share Registrar (RTS)",
      "link": "https://www.investopaper.com/news/bishal-bazar-company-share-registrar-rts/",
      "date": "January 16, 2022",
      "summary": "Investopaper Bishal Bazar Company Limited (BBC) has appointed Prabhu Capital Limited as the Registrar To Share",
      "full_content": "Bishal Bazar Company Limited (BBC) has appointed Prabhu Capital Limited as the Registrar To Share (RTS) to be effective from Magh 1, 2078 BS. The company will hand over all the share-related works (RTS) such as share issue, registration of shares, transfer of name, and others to Prabhu Capital Limited.\n\nPrabhu Capital Limited is the subsidiary company of Prabhu Bank Limited. It is a licensed merchant banker from the Securities Board of Nepal. It provides various services such as Issue Management, Security Underwriting, Registrar to the Shares (RTS), Depositary Participant, and Portfolio Management Services.\n\nSuggested Readings:\n\nList Of Merchant Bankers In Nepal\n\nList of  Depository Participants (DPs) In Nepal",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/07/share-registrar-1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Market Capitalization Of Development Banks In Nepal",
      "link": "https://www.investopaper.com/news/market-capitalization-of-development-banks-in-nepal/",
      "date": "September 6, 2021",
      "summary": "Investopaper The market capitalization of a company refers to the total market value of the outstanding",
      "full_content": "The market capitalization of a company refers to the total market value of the outstanding shares of that company. So, basically the market capitalization (also known as market cap or market value) of a company is obtained by multiplying the market price per share to the number of outstanding shares of that company. This calculation will help you to determine the size and the strength of the company in the market.\n\nRelated:\n\nMarket Capitalization Of Commercial Banks Of Nepal\n\nMarket Capitalization Of Non-Life (General) Insurance Companies In Nepal\n\nMarket capitalization can be helpful to diversify your portfolio because it is essential to pick different sized companies to minimize the risk associated with your investment. One of the basic features of blue-chip stocks is large market capitalization. On the other hand, the company with small market capitalization can become the most valuable companies in your portfolio if they become successful. But they have a high risk compared to large-cap companies.\n\nMarket cap is also a useful metric to determine the changing position of a company in the stock market either it be large, medium or small companies. Likewise, it also reflects the overall market behavior and sentiment too. For instance, when the total market cap of a Nepalese stock market increases on a daily basis for a time period, it is understandable that the market is on an upward trend and vice versa.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/09/Market-Capitalization-800x445.jpg",
      "source": "Investopaper"
    }
  ]
}