{
  "symbol": "CREST",
  "last_updated": "2025-07-18T12:28:34.290771",
  "news": [
    {
      "title": "IPO Shares of Crest Micro Life Insurance Listed in Nepse",
      "link": "https://www.investopaper.com/news/ipo-shares-of-crest-micro-life-insurance-listed-in-nepse/",
      "date": "April 10, 2025",
      "summary": "Investopaper Nepal Stock Exchange has listed the IPO shares of Crest Micro Life Insurance Limited. As",
      "full_content": "Nepal Stock Exchange has listed the IPO shares of Crest Micro Life Insurance Limited.\n\nAs per the information, 75,00,000 units IPO shares of Crest Micro Life InsuranceLimited (CREST) has been listed in NEPSE. The open price range is set as Rs. 100.86 to Rs. 302.58 for the first transactions.\n\nCrest Micro Life Insurance had floated shares to the general public from Falgun 22, 2081 BS to Falgun 26, 2081 BS.\n\nAfter the listing, investors can trade their shares in the market. The trading of shares of CREST will start from Today.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo-listing.jpg",
      "source": "Investopaper"
    },
    {
      "title": "IPO Allotment of Crest Micro-Life Insurance Concluded [IPO Result !!]",
      "link": "https://www.investopaper.com/news/crest-micro-life-insurance-ipo/",
      "date": "March 18, 2025",
      "summary": "Investopaper IPO Allotment Of Crest Micro-Life Insurance Limited NIMB Ace Capital Limited, the issue manager for",
      "full_content": "NIMB Ace Capital Limited, the issue manager for the initial public offering (IPO) of Crest Micro-Life Insurance Limited, has concluded the IPO allotment process on Tuesday.\n\nAfter the allotment, 1,84,500 applicants received 10 shares each through lottery. A total of 19,55,685 valid applicants had subscribed for the shares. About 17.71 lakh applicants were left empty-handed.\n\nTo view the IPO result of Crest Micro-Life Insurance Limited, click the link below:\n\nIPO Result Of Crest Micro-Life Insurance Limited\n\nAfter the first phase, Crest Micro-Life Insurance Limited had issued the shares to the general public in the second phase of an initial public offering (IPO) from Falgun 22, 2081 BS.\n\nThe company had sold 18,45,000 shares at Rs. 100 per share to the general public.\n\nDue to over-subscription of shares, the second phase of the IPO was closed on Falgun 26, 2081 BS.\n\nInterested investors could apply for a minimum of 10 shares and a maximum of 10,000 shares.\n\nThe company allotted 1,12,500 shares to the mutual fund schemes and has reserved 67,500 shares to the employees.\n\nIn the first phase of the IPO, Crest Micro-Life Insurance Limited had floated 2,25,000 shares (10 percent of general public’s quota) to the foreign employed Nepalis from Magh 15, 2081 BS. The first phase of the IPO was closed on Magh 29, 2081 BS.\n\nInterested Nepalis in foreign employment could apply for a minimum of 10 shares and a maximum of 10,000 shares.\n\nIn total, the company has plans to sell 22,50,000 unit shares in the public offering (including the first and the second phase). At a par value of Rs 100, the public issue amounts to Rs 22.50 crores.\n\nSecurities Board Of Nepal (SEBON) gave the approval to the company on Magh 3, 2081 BS regarding the public issuance.\n\nNIMB Ace Capital Limited is the issue and sales manager for the IPO.The agreement was signed by Mr. Sibanta Bahadur Pande, Chief Executive Officer of NIMB Ace Capital and Mr. Pratap Man Shrestha, Chief Executive Officer of Crest Micro-Life Insurance Limited.\n\nCrest Micro-Life Insurance Limited, incorporated on Jestha 14, 2080 BS as a public limited company, has a license from Nepal Insurance Authority to operate micro-life insurance business in Nepal.\n\nAs of Ashad’s end 2081 BS, the major promoters of the company include:\n\n—Himalayan Reinsurance Limited (21.43% share),\n\n—Metro Capital Pvt. Ltd. (16.62% share),\n\n—Kishan Lal Dugar (6.67% share),\n\n—K.R.S Investment Pvt. Ltd. (6.67% share),\n\n—Sangeeta Devi More (3.97% share),\n\n—Anupam Rathi (3.33% share) and others",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/07/IPO-1-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Public Issue Worth Rs. 39.11 Billion Approved in FY 2024/25",
      "link": "https://www.investopaper.com/news/public-issue-approval-sebon/",
      "date": "July 9, 2025",
      "summary": "Investopaper Securities Board of Nepal (SEBON) has provided approval for the public issue worth Rs 39.11",
      "full_content": "Securities Board of Nepal (SEBON) has provided approval for the public issue worth Rs 39.11 billion in the first eleven months of the current fiscal year 2024/25 [2081/82]. Altogether, SEBON has approved the issue of 49 securities. Of them, 16 companies received the approval to issue the right share, and 10 companies received permission to float the IPO. Likewise, 16 mutual fund schemes and 7 debenture issue also received the final approval from SEBON.\n\nAlso Read:\n\nHow to apply IPO/FPO/Right Share through Mero Share?\n\nUpcoming Initial Public Offerings (IPO) In Nepal\n\nThe public issue amount approved by the Securities Board include:\n\n1. Right Share: Rs 14.94 Billion\n\n2. Ordinary Share: Rs. 2.75 Billion\n\n3. Mutual Funds: Rs 13 Billion\n\n4. Debenture: Rs. 8.42 Billion\n\nThe table below presents the list of companies those companies that received public issue approval from SEBON.\n\n(Mid-July 2024 – Mid-June 2025)\n\n(Rs. Million)\n\nSource:Securities Board of Nepal (SEBON)\n\n(Mid-July 2023 – Mid-July 2024)\n\n(Rs. Million)\n\nSource:Securities Board of Nepal (SEBON)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2023/01/securities-board-of-nepal-sebon.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Securities of 9 Companies Listed in NEPSE in Jestha",
      "link": "https://www.investopaper.com/news/shares-listing-monthwise/",
      "date": "June 19, 2025",
      "summary": "Investopaper The table below presents the new listing of shares in the month of Jestha, 2082",
      "full_content": "The table below presents the new listing of shares in the month of Jestha, 2082 BS.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/10/listing.jpg",
      "source": "Investopaper"
    },
    {
      "title": "4 Micro Life Insurance & Micro Insurance Companies to Sell 90 Lakh Shares in IPO",
      "link": "https://www.investopaper.com/news/4-micro-life-insurance-micro-insurance-companies-to-sell-90-lakh-shares-in-ipo/",
      "date": "November 21, 2024",
      "summary": "Investopaper Four micro life insurance and micro insurance companies are in the process of issuing the",
      "full_content": "Four micro life insurance and micro insurance companies are in the process of issuing the shares to the general public. These companies include:\n\nThese companies have already submitted an application to the Securities Board of Nepal (SEBON) seeking permission to float the shares to the general public. In total, the four companies are trying to raise Rs. 90 crores from the public offering by selling 90,00,000 shares at a par value of Rs. 100.\n\nThe table below presents the IPO status of the four companies.\n\nSource: Securities Board of Nepal (SEBON)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/07/IPO-1-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "List of Insurance Companies In Nepal [Updated]",
      "link": "https://www.investopaper.com/news/list-of-insurance-companies-in-nepal/",
      "date": "August 29, 2023",
      "summary": "Investopaper As of Shrawan’s end, 2080 BS, there are 34 insurance companies operating in Nepal. The",
      "full_content": "As of Shrawan’s end, 2080 BS, there are 34 insurance companies operating in Nepal. The insurance companies in Nepal are divided into 4 types:\n\n1. Life Insurance\n\n2. Non-Life of General Insurance\n\n3. Reinsurance\n\n4. Microinsurance\n\nAmong the 34 insurance companies, 14 are life insurance, 14 are non-life or general insurance, 2 are reinsurance companies and 4 are microinsurance companies.\n\nLife insurance is a contractual transaction in which a person pays a certain amount in installments based on the age of the person and in the event of his death his heirs receive a certain amount.\n\nThere are currently 14 life insurance companies in Nepal. The list of the life insurance companies is shown below:\n\n1. Rastriya Beema Sansthan\n\n2. National Life Insurance Co. Ltd.\n\n3. Nepal Life Insurance Co. Ltd.\n\n4. Life Insurance Corporation (Nepal) Ltd.\n\n5. Met Life ALICO (American Life Insurance Company)\n\n6. Asian Life Insurance Co. Ltd.\n\n7. SuryaJyoti Life Insurance Co. Ltd.\n\n8. IME Life Insurance Co. Ltd.\n\n9. Sun Nepal Life Insurance Co. Ltd.\n\n10. Sanima Reliance Life Insurance Co. Ltd.\n\n11. Reliable Nepal Life Insurance Co. Ltd.\n\n12. Citizen Life Insurance Ltd.\n\n13. Prabhu Mahalaxmi Life Insurance Co. Ltd.\n\n14. Himalayan Life Insurance Ltd.\n\nYou May Also Like:\n\nCurrent Status of Life Insurance Business In Nepal\n\nTop 5 Life Insurance In Nepal\n\nNon-life insurance is an agreement made to avoid the risk of loss of property and liability. It is generally used to insure movable and immovable property such as houses, factories, vehicles, etc.\n\nNon-life insurance covers accidents, medical expenses, third party liability, production liability, risks involved in foreign travel. It is used to obtain compensation for damage caused by various natural calamities including accidents, fires, thefts and to get compensation or relief from possible losses due to risk.\n\nAt current, there are 14 general or non-life insurance companies in Nepal. Nepal Insurance Company is a pioneer non-lifeinsurance companyofNepalthat was established on 1947 A.D.\n\nBelow are the list of 14 general or non-life insurance companies of Nepal:\n\n1. Nepal Insurance Co. Ltd.\n\n2. The Oriental Insurance Co. Ltd.\n\n3. National Insurance Co. Ltd.\n\n4. Himalayan Everest  Insurance Insurance Co. Ltd.\n\n5. United Ajod Insurance Ltd.\n\n6. Siddhartha Premier Insurance Co. (Nepal) Ltd.\n\n7. Neco Insurance Ltd.\n\n8. Sagarmatha Lumbini Insurance Co. Ltd.\n\n9.Prabhu Insurance Ltd.\n\n10. Shikhar Insurance Co. Ltd.\n\n11. NLG Insurance Ltd.\n\n12.Rastriya Beema Co. Ltd.\n\n13. Sanima GIC Insurance Ltd.\n\n14. IGI Prudential Insurance Ltd.\n\nAlso Read:Top 5 Non-Life Insurance in Nepal\n\nSince insurance companies cannot bear the entire risk of the insurance they cover, they transfer the risk from one company to another to reduce the risk, which is called reinsurance.\n\nSo far, there are 2 reinsurance companies in Nepal-Nepal Reinsurance Company and Himalayan Reinsurance Company. Nepal Reinsurance Company was established on Karthik 20, 2071 BS. Likewise, Himalayan Reinsurance Company started operation from Ashad 32, 2078 BS.\n\n1. Nepal Reinsurance Co. Ltd.\n\n2. Himalayan Reinsurance Ltd.\n\nMicroinsurance refers to a type of insurance specifically designed to provide coverage to low-income individuals and families who have limited access to traditional insurance products. Microinsurance can cover various areas such as health, life, property, agriculture, and more.\n\nAt present, there are 4 microinsurance companies operating in Nepal.\n\n1. Nepal Micro Insurance Co. Ltd.\n\n2. Guardian Micro Life Insurance Ltd.\n\n3. Crest Micro Life Insurance Ltd.\n\n4. Protective Micro Insurance Ltd.\n\nRead Related Contents:\n\nHistory Of Insurance In Nepal\n\nList of ‘A’ Class Commercial Banks In Nepal\n\nShare This Via:",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/05/INSURANCE-COVERAGE.jpg",
      "source": "Investopaper"
    },
    {
      "title": "7 Micro-Insurance Companies Receive Approval For Operation",
      "link": "https://www.investopaper.com/news/7-micro-insurance-companies-receive-approval-for-operation/",
      "date": "November 28, 2022",
      "summary": "Investopaper Nepal Insurance Authority has given pre-approval to seven micro insurance companies for operations. The authority",
      "full_content": "Nepal Insurance Authority has given pre-approval to seven micro insurance companies for operations.\n\nThe authority granted permission to three micro life insurance companies and four micro non-life insurance companies on Sunday. One company was selected from each province. 31 companies had applied to the authority seeking a license to operate micro insurance companies.\n\n1.Crest Micro-Life Insurance Ltd., (Birendranagar, Surkhet, Karnali Province)\n\n2. Guardian Micro-Life Insurance Ltd., (Biratnagar 7, Morang, Province 1)\n\n3. Liberty Micro-Life Insurance Ltd. (Pokhara 8 Kaski, Gandaki Province)\n\n1. Nepal Micro Insurance Co. Ltd. (Bharatpur 1, Chitwan, Bagmati Province)\n\n2. Protective Micro Insurance Ltd. (Kailali, Sudurpaschim Province)\n\n3. Star Micro Insurance Company Ltd. (Janakpurdham Dhanusha, Madhesh Province)\n\n4.Trust Micro Insurance Co.Ltd. (Butwal 2, Rupandehi, Lumbini Province)\n\nThe Authority had issued a 35-day notice on Bhadra 10 for the establishment of the company doing micro insurance business.\n\nThe company that has received the permission to operate the business must go to the company registrar’s office and register the company within 35 days.After receiving the company registration certificate, an application for a license must be submitted to the Nepal Insurance Authority.\n\nAfter getting the license to operate the company, 70 percent of the paid-up capital must be deposited in the bank in the name of the company.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/11/nepal-insurance-authority-800x445.jpg",
      "source": "Investopaper"
    }
  ]
}