{
  "symbol": "NABIL",
  "last_updated": "2025-07-24T10:06:05.141764",
  "news": [
    {
      "title": "Nabil Bank Issuing 30 Lakh Units of “7% Nabil Bank Debenture 2089” from Today",
      "link": "https://www.investopaper.com/news/nabil-bank-debenture-2089/",
      "date": "July 22, 2025",
      "summary": "Investopaper Nabil Bank Ltd. (NABIL) is currently issuing a debenture named “7% Nabil Bank Debenture, 2089”.",
      "full_content": "Nabil Bank Ltd. (NABIL) is currently issuing a debenture named “7% Nabil Bank Debenture, 2089”.\n\nThe debenture offering is open from Shrawan 6, 2082 BS and close on Shrawan 9, 2082 BS.\n\nThe Bank is floating 30 lakh units debenture at a face value of Rs 1,000. Hence, the total debenture issue amounts to Rs 3 Arba.\n\nOut of the total issue, the bank is selling 18 lakh units debenture worth Rs. 180 crores through private placement. Likewise, the general public can apply for the remaining 12 lakh units that amount to Rs. 120 crores. Out of the general public’s quota, 5 percent has been reserved for the mutual fund schemes.\n\nFor this purpose, Securities Board of Nepal (SEBON) has given the permission to the company on Ashad 12, 2082 BS. The bank had submitted an application to the board on Ashad 14, 2081 BS seeking permission to issue the debenture.\n\nThe debenture will provide 7 percent interest per annum to the investors. The maturity period of the debenture is 8 years. Hence, the bank will refund the principal amount in 2089 BS.\n\nThe bank has appointed Nepal SBI Merchant Banking Limited the issue and sales manager for the debenture. An agreement has already been reached between the bank and Nepal SBI Merchant Banking in this regard.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/04/nabil-bank.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Balanced Fund-2 (NBF2) Reports Net Asset Value of Rs. 11.51",
      "link": "https://www.investopaper.com/news/nabil-balanced-fund-2-monthly-report/",
      "date": "April 28, 2025",
      "summary": "Investopaper Nabil Balanced Fund-2 (NBF2) has reported a Net Asset Value (NAV) of Rs 11.51 until",
      "full_content": "Nabil Balanced Fund-2 (NBF2) has reported a Net Asset Value (NAV) of Rs 11.51 until the end of Chaitra, 2081 BS. As per the monthly report, the scheme has disclosed a decrease in NAV as compared to the end of the previous month. As of Falgun’s end 2081 BS, the NAV stood at Rs 11.72.\n\nYou May Also Like:\n\nNet Asset Value (NAV) Of Mutual Fund Schemes In Nepal\n\nHow To Buy Mutual Fund Schemes In Nepal?\n\nNBF2 has a total investment value of Rs 94.40 crores in stocks of listed companies. Such investment stood at Rs 95.97 crores in the previous month. Likewise, the scheme has invested Rs 20.10 crores in debenture/bonds and zero amount in fixed deposits. As of the end of Chaitra, NBF2 has a bank balance of Rs 13.30 crores.\n\nIn the first nine month of the current fiscal year 2081/82, NBF2 has posted a gross profit of Rs 16.50 crores. From the fiscal year 2080/81, the scheme has distributed an 8 percent cash dividend to its unit-holders.\n\nNabil Balanced Fund-2 (NBF2) is a close ended-mutual fund scheme operated by the fund manager Nabil Investment Banking Limited under Nabil Mutual Fund. The fund has a size of Rs 1.12 Arba. It has a maturity period of 10 years. The fund will retire on Jestha 16, 2086 BS.\n\nMore From Investopaper:\n\nDividend Announcement By Mutual Funds In Nepal\n\n15 Biggest Mutual Fund Schemes in Nepal",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/10/mutual-fund-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Flexi Cap Fund Reports Decline in NAV in Chaitra",
      "link": "https://www.investopaper.com/news/nabil-flexi-cap-fund-monthly-report/",
      "date": "April 28, 2025",
      "summary": "Investopaper Nabil Flexi Cap Fund has reported a Net Asset Value (NAV) of Rs 11.38 until",
      "full_content": "Nabil Flexi Cap Fund has reported a Net Asset Value (NAV) of Rs 11.38 until the end of Chaitra, 2081 BS. As per the monthly report, the scheme has disclosed an decline in NAV as compared to the end of the previous month. As of Falgun’s end 2081 BS, the NAV stood at Rs 11.67.\n\nYou May Also Like:\n\nNet Asset Value (NAV) Of Mutual Fund Schemes In Nepal\n\nHow To Buy Mutual Fund Schemes In Nepal?\n\nThe mutual fund scheme has a total investment value of Rs 81.57 crores in stocks of listed securities. Such investment stood at Rs 79.24 crores in the previous month. Likewise, the scheme has invested Rs 3.19 crores in debenture/bonds. As of the end of Magh, the scheme has a bank balance of Rs 29.27 crores.\n\nIn the first nine months of the current fiscal year 2081/82, the open-ended scheme has posted a gross profit of Rs. 7.45 crores.\n\nNabil Flexi Cap Fund is an open ended-mutual fund scheme operated by the fund manager Nabil Investment Banking Limited under Nabil Mutual Fund. The fund has a size of Rs 102.21 crores [Chaitra’s End, 2081 BS].\n\nIn an open-ended mutual fund, interested investors can purchase or sell the units of the fund directly from the fund. There is no need to purchase from existing unitholders.\n\nMore From Investopaper:\n\n15 Biggest Mutual Fund Schemes in Nepal\n\nDividend Announcement By Mutual Funds In Nepal",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/09/growth-chart-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Lumbini Ceramics Limited to Float IPO | Appoints Nabil Investment Banking as Issue Manager",
      "link": "https://www.investopaper.com/news/lumbini-ceramics-ipo/",
      "date": "February 4, 2025",
      "summary": "Investopaper Lumbini Ceramics Limited is in the process of issuing shares to the public (IPO). For",
      "full_content": "Lumbini Ceramics Limited is in the process of issuing shares to the public (IPO). For this purpose, the company has appointed Nabil Investment Banking Limited as the issue and sales manager.\n\nThe agreement for public offering was signed between the company and Nabil Investment Banking Limited on this regard. Mr. Shyam Sundar Khetan, Director of Lumbini Ceramics Limited and Manish Narayan Joshi, CEO of Nabil Investment Banking inked the agreement.\n\nNow, the company needs to submit the application to the Securities Board Of Nepal (SEBON). If approved by SEBON, the company can issue the shares to the public.\n\nLumbini Ceramics Limited, incorporated in 2019 as a private limited company, was converted to ‘Public Limited’ company on February 23,  2023. The company is a manufacturer of ‘Glazed Vitrified Tiles’ under the brand name “Laminar”.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo-1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Bank Conducting 40th AGM Today | To Endorse 10 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-bank-agm/",
      "date": "December 12, 2024",
      "summary": "Investopaper Nabil Bank Limited is conducting its 40th Annual General Meeting (AGM) on Mangsir 27, 2081",
      "full_content": "Nabil Bank Limited is conducting its 40th Annual General Meeting (AGM) on Mangsir 27, 2081 BS [December 12, 2024]. The Annual Meeting will take place at Rastriya Sabha Griha, Pardasanimarg, Kathmandu. The AGM will start after 10 AM.\n\nMajor Agendas:\n\nDiscussion and approval of financial reports of the fiscal year 2080/81.\n\nEndorsement of 10 percent dividend to the shareholders.\n\nAppointment of auditor for the fiscal year 2081/82.\n\nDelegation of authority to BOD for any merger/acquisition decisions.\n\nBook Closure Date:\n\nFor the distribution of dividends and AGM purposes, Nabil Bank had fixed the book closure date on Mangsir 10, 2081 BS. The investors purchasing/holding shares of NABIL until Mangsir 9 are eligible for the dividend and can participate in the annual meeting.\n\nRead Related Contents:\n\nDividend History Of Nabil Bank Limited (NABIL)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/04/nabil-bank.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Bank Proposes 10 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-bank-dividend/",
      "date": "October 30, 2024",
      "summary": "Investopaper Nabil Bank Limited (NABIL), one of the leading private sector bank of Nepal, has declared",
      "full_content": "Nabil Bank Limited (NABIL), one of the leading private sector bank of Nepal, has declared the dividend to the shareholders. The dividend announcement is from the fiscal year 2080/81.\n\nThe board of directors meeting held on Karthik 13, 2081 BS has proposed a 10 percent dividend. The dividend will be in the form of cash. The bank has not proposed any bonus share.\n\nAs of Ashad’s end 2081 BS, Nabil Bank has a paid-up capital of Rs 27.05 Arba. At this capital, the cash dividend is worth Rs 2.70 Arba.\n\nThe dividend is subject to approval from Nepal Rastra Bank and the upcoming Annual General Meeting (AGM).\n\nFrom the previous fiscal year 2079/80, Nabil Bank had distributed an 11 percent cash dividend to the shareholders.\n\nRead Related Contents:\n\nDividend History Of Nabil Bank Limited (NABIL)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/04/nabil-bank.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Flexi Cap Fund to Distribute 5 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-flexi-cap-fund-dividend/",
      "date": "September 12, 2024",
      "summary": "Investopaper Nabil Flexi Cap Fund has proposed the dividend to its unit-holders. The dividend announcement is",
      "full_content": "Nabil Flexi Cap Fund has proposed the dividend to its unit-holders. The dividend announcement is from  the fiscal year 2080/81.\n\nNBF2 has declared a 5 percent cash dividend to its unitholders. The board meeting of Nabil Investment Banking Limited held on Bhadra 25, 2081 BS made the announcement about the dividend.\n\nRelated:Nabil Balanced Fund-2 (NBF2) Dividend\n\nNabil Flexi Cap Fund is an open ended-mutual fund scheme operated by the fund manager Nabil Investment Banking Limited under Nabil Mutual Fund. The fund has a size of Rs 62.43 crores [Ashad’s End, 2081 BS].\n\nSuggested Readings:\n\nDividend Announcement By Mutual Funds In Nepal\n\nMutual Funds In Nepal: Every Thing You Need To Know",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/01/DIVIDEND-HISTORY.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Balanced Fund-2 (NBF2) Proposes 8 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-balanced-fund-2-dividend/",
      "date": "September 11, 2024",
      "summary": "Investopaper Nabil Balanced Fund-2 (NBF2) has proposed the dividend to its unit-holders. The dividend announcement is",
      "full_content": "Nabil Balanced Fund-2 (NBF2) has proposed the dividend to its unit-holders. The dividend announcement is from  the fiscal year 2080/81.\n\nNBF2 has declared an 8 percent cash dividend that amounts to Rs 8.96 crores. The board meeting of Nabil Investment Banking Limited held on Bhadra 25, 2081 BS made the announcement about the dividend.\n\nRelated:Nabil Equity Fund (NEF) Dividend\n\nFrom the previous fiscal year 2079/80, NBF2 had distributed a 9.6 percent cash dividend to its unitholders that amounted to Rs. 10.75 crores. Similarly, from the fiscal year 2078/79, the scheme had distributed a 7 percent cash dividend worth Rs 7.84 crores. Likewise, in the fiscal year 2077/78, NBF2 had provided a 35 percent cash dividend that amounted to Rs 39.20 crores.\n\nSimilarly, in the fiscal year 2076/77, the mutual fund scheme had distributed a a 9 percent cash dividend worth Rs 10.08 crores.\n\nNabil Balanced Fund-2 is a close-ended equity scheme with the fund size of NPR. 1.12 Arba. The fund has a maturity period of 10 years. It will mature on 16th Jestha, 2086. The scheme was allotted to unit-holders on 17th Jestha 2076.\n\nNabil Investment Banking Limited is the fund manager of the scheme.\n\nSuggested Readings:\n\nDividend Announcement By Mutual Funds In Nepal\n\nMutual Funds In Nepal: Every Thing You Need To Know",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/01/dividend-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Balanced Fund-2 (NBF2) Announces Book Closure Date for Dividend Distribution",
      "link": "https://www.investopaper.com/news/nabil-balanced-fund-2-nbf2-announces-book-closure-date-for-dividend-distribution/",
      "date": "September 11, 2024",
      "summary": "Investopaper Nabil Balanced Fund-2 (NBF2), a close-ended mutual fund scheme operated by Nabil Investment Banking Limited,",
      "full_content": "Nabil Balanced Fund-2 (NBF2), a close-ended mutual fund scheme operated by Nabil Investment Banking Limited, is going to close the unit-holders registration book for the purpose of dividend distribution.\n\nThe fund manager has announced the book closure date on Ashwin 11, 2081 BS. Therefore, investors holding/purchasing units of the scheme until Ashwin 10, 2081 BS will receive the 8 percent cash dividend declared for the fiscal year 2080/81.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/09/BOOK-CLOSE-DATE-800x445.png",
      "source": "Investopaper"
    },
    {
      "title": "Bhugarbha Cement Limited to Float IPO | Appoints Nabil Investment Banking as Issue Manager",
      "link": "https://www.investopaper.com/news/bhugarbha-cement-ipo/",
      "date": "July 1, 2024",
      "summary": "Investopaper Bhugarbha Cement Limited is in the process of issuing shares to the public (IPO). For",
      "full_content": "Bhugarbha Cement Limited is in the process of issuing shares to the public (IPO). For this purpose, the company has appointed Nabil Investment Banking Limited as the issue and sales manager.\n\nThe agreement for public offering was signed between the company and Nabil Investment Banking Limited on this regard. Mr. Deepak Raj Giri, Chief Executive Officer of Bhugarbha Cement Limited and Manish Narayan Joshi, CEO of Nabil Investment Banking inked the agreement.\n\nNow, the company needs to submit the application to the Securities Board Of Nepal (SEBON). If approved by SEBON, the company can issue the shares to the public.\n\nThe company is planning to sell 20 percent of the issued capital of the company in the public offering. The par value of each share is Rs. 100.\n\nBhugarbha Cement Limited currently produces both OPC and PPC cement in the name Bhugarbha (OPC), Apollo, Crystal, Deurali etc. The annual production capacity of the company is 60,000 metric tons of OPC cement and 150,000 metric tons of PPC cement.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Bank Limited Opening the Issue of \"7% Nabil Debenture, 2089\" From Today",
      "link": "https://www.sharesansar.com/newsdetail/nabil-bank-limited-opening-the-issue-of-7-nabil-debenture-2089-from-today-2025-07-22",
      "date": "2025-07-22",
      "summary": null,
      "full_content": "Nabil Bank Limited has issued 10,00,000 units of\"8 yrs, 7% Nabil Debenture, 2089\"to the general public.\n\nThe debenture with a maturity period of 8 years and a coupon rate of 7% will be open for application from today, i.e., from 6th Shrawan to 9th Shrawan, 2082. If the issue isn't fully subscribed, the deadline can be extended to Shrawan 20, 2082.\n\n30,00,000 units will be issued at a par value of Rs. 1000 per unit. Out of the total units being issued, 60%, i.e., 18 lakh units, the total issue will be subscribed via private placement, while the remaining 12 lakh units worth Rs. 1.20 Arba will be open for public issue. For mutual funds, 5%, i.e., 60,000 units, will be allocated. It will raise a total of Rs 3 Arba from the issuance.\n\nNepal SBI Merchant Banking Limited is the issue manager. Investors can apply for a minimum of 25 units and a maximum of 12,00,000 units.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Nabil Bank Wins Gold at NBPA 2024 for Outstanding Financial Reporting",
      "link": "https://www.sharesansar.com/newsdetail/nabil-bank-wins-gold-at-nbpa-2024-for-outstanding-financial-reporting-2025-07-20",
      "date": "2025-07-20",
      "summary": null,
      "full_content": "Nabil Bank Limited has won the National Best Presented Annual Report Award (NBPA) – 2024 Gold Award for the second consecutive year, presented by the Institute of Chartered Accountants of Nepal (ICAN).\n\nThe award recognizes the bank’s excellence in financial transparency, corporate governance, and accountability for its 2023/24 annual report.\n\nThe report is also nominated for the SAFA BPA Awards, representing Nepal at the regional level.\n\nWith over 2.5 million customers, 268 branches, and 321 ATMs, Nabil Bank continues to lead in innovation and financial reporting excellence.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Nabil Bank Celebrates 41 Years of Excellence: Leading Nepal’s Financial Growth and Digital Innovation",
      "link": "https://www.sharesansar.com/newsdetail/nabil-bank-celebrates-41-years-of-excellence-leading-nepals-financial-growth-and-digital-innovation-2025-07-14",
      "date": "2025-07-14",
      "summary": null,
      "full_content": "Nabil Bank, one of Nepal’s pioneering financial institutions, has marked its 41st anniversary, highlighting a legacy of strong growth, digital leadership, and national economic contribution since its founding in 1984. Beginning with just two branches and 144 employees, the bank now serves nearly 2.5 million customers through 268 branches, 321 ATMs, and 21 extension counters.\n\nThe bank has seen exponential growth over four decades, with its net worth rising from NPR 28 million to NPR 61.24 billion, and total assets increasing from NPR 269 million to NPR 611.86 billion. Its loan and deposit volumes have also surged significantly, reinforcing its status as Nepal’s leading commercial bank.\n\nNabil Bank has strategically invested in productive sectors such as agriculture, energy, MSMEs, and subsidized lending, contributing to over 3,000 MW of energy generation and broad-based employment.\n\nA trailblazer in digital banking, the bank introduced services like mobile banking, QR payments, online account opening, and online loans, making banking more accessible and efficient.\n\nTo celebrate its anniversary, Nabil launched two customer-focused initiatives: a 41-day free debit card offer for new savings accounts and the Nabil Smart Naari Home Loan Scheme, which supports women with flexible, affordable home financing and includes a lifetime free credit card.\n\nAs it moves into its 42nd year, CEO Manoj Kumar Gyawali reaffirmed Nabil’s commitment to sustainable, innovative, and customer-centric banking, appreciating the stakeholders who have supported its journey.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Nabil Bank Limited To Issue Rs. 3 Arba Worth \"7% Nabil Debenture, 2089\" From Shrawan 6",
      "link": "https://www.sharesansar.com/newsdetail/nabil-bank-limited-to-issue-rs-3-arba-worth-7-nabil-debenture-2089-from-shrawan-6-2025-07-14",
      "date": "2025-07-14",
      "summary": null,
      "full_content": "Nabil Bank Limited has published an offer letter to issue 30,00,000 units of\"8 yrs, 7% Nabil Debenture, 2089\"to the general public.\n\nThe debenture with an 8-year maturity period and a 7% coupon rate will be open for application from 6th Shrawan to 9th Shrawan, 2082. If the issue isn't fully subscribed, the deadline can be extended to Shrawan 20, 2082.\n\n30,00,000 units will be issued at a par value of Rs. 1000 per unit. Out of the total units being issued, 60%, i.e., 18 lakh units, the total issue will be subscribed via private placement, while the remaining 12 lakh units worth Rs. 1.20 Arba will be open for public issue. For mutual funds, 5%, i.e., 60,000 units, will be allocated. It will raise a total of Rs 3 Arba from the issuance.\n\nNepal SBI Merchant Banking Limited is the issue manager. Investors can apply for a minimum of 25 units and a maximum of 12,00,000 units.\n\nNotice:",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Nabil Sustainable Banking Enters Fifth Year; ‘Nabil Green Week’ Launched to Promote Sustainability",
      "link": "https://www.sharesansar.com/newsdetail/nabil-sustainable-banking-enters-fifth-year-nabil-green-week-launched-to-promote-sustainability-2025-07-01",
      "date": "2025-07-01",
      "summary": null,
      "full_content": "Nabil Bank has announced the commencement of the fifth year of its ‘Nabil Sustainable Banking’ initiative. Marking the occasion, the bank is organizing ‘Nabil Green Week’ from June 30 to July 6 (Ashad 15 to 21), featuring various sustainability-focused programs in the presence of stakeholders from diverse sectors.\n\nThroughout the week, a series of webinars will be held in collaboration with industry experts, including representatives from GIZ Nepal, Simple Energy Pvt. Ltd., BYD, CG Motors, and other ESG and agriculture specialists. The sessions aim to foster discussions on solar rooftop solutions, electric mobility, sustainable agriculture, and ESG-based investments, creating a platform for knowledge exchange.\n\nOver the years, Nabil Bank has embedded sustainability into its core operations by aligning with Nepal’s Sustainable Development Goals (SDGs). The bank reports that through investments in renewable energy, it has contributed to the reduction of 11,172 tons of greenhouse gas emissions and invested in 43 hydropower projects across 21 districts. Its sustainable finance initiatives have supported over 46,000 individuals, with significant investments in agriculture, electric vehicle loans, and women-led enterprises. The bank has also emphasized digital banking, financial literacy, and inclusive growth through programs such as Nabil School of Social Entrepreneurship and branchless banking services.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "NRB Report Highlights Commercial and Development Banks' Net Profits up to Baisakh; NABIL Tops the Charts Once More",
      "link": "https://www.sharesansar.com/newsdetail/nrb-report-highlights-commercial-and-development-banks-net-profits-up-to-baisakh-nabil-tops-the-charts-once-more-2025-06-13",
      "date": "2025-06-13",
      "summary": null,
      "full_content": "No readable content found",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Prime Commercial Bank Wins Mahalaxmi Corporate Cricket League 2025 – Season 4",
      "link": "https://www.sharesansar.com/newsdetail/prime-commercial-bank-wins-mahalaxmi-corporate-cricket-league-2025-season-4-2025-06-11",
      "date": "2025-06-11",
      "summary": null,
      "full_content": "Mahalaxmi Bikas Bank Limited successfully concluded the 4th edition of the Mahalaxmi Corporate Cricket League 2025, organized on the occasion of its 31st anniversary. Held in Kathmandu from Jestha 21 to 24, 2082 (June 4–7, 2025), the tournament featured 24 teams from various banks, financial institutions, insurance companies, merchant banks, and microfinance institutions.\n\nPrime Commercial Bank Limited clinched the championship title, while Nabil Bank Limited secured second place. The award distribution ceremony was held on Jestha 26, 2082 (June 9, 2025), where Deputy Governor of Nepal Rastra Bank, Mr. Bam Bahadur Mishra, and MLBL Chairperson Mr. Rajesh Upadhyay jointly handed over the winner’s trophy.\n\nIndividual awards were presented to:\n\ni. Best Fielder: Amrit Chaulagain (Nabil Bank)\n\nii. Best Wicketkeeper: Bijay Para Limbu (Nabil Bank)\n\niii. Best Bowler: Anil Bartola (NMB Bank)\n\niv. Best Batsman & Player of the Tournament: Suraj Timilsina (ICFC Finance)\n\nMahalaxmi Bikas Bank expressed heartfelt gratitude to all sponsors, participating teams, and individuals who contributed to the successful execution of the tournament.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Nabil Bank Appoints Mr. Manoj Kumar Gyawali as Chief Executive Officer",
      "link": "https://www.sharesansar.com/newsdetail/nabil-bank-appoints-mr-manoj-kumar-gyawali-as-chief-executive-officer-2025-06-05",
      "date": "2025-06-05",
      "summary": null,
      "full_content": "Nabil Bank Limited has appointed Mr. Manoj Kumar Gyawali as the Chief Executive Officer (CEO) of the Bank. The decision was made during the Bank’s 682nd Board Meeting held on 22nd Jestha, 2082.\n\nMr. Gyawali, who had been serving as the Acting CEO, has now been formally appointed to the position for a tenure of four years, effective from 22nd Jestha, 2082.\n\nMr. Gyawali had been serving as the Acting CEO prior to his official appointment. Widely recognized as a motivational speaker and an effective communicator, he brings with him over 26 years of extensive experience in the banking and capital markets sector. He is a qualified Chartered Accountant and has held significant leadership roles at Nepal Rastra Bank, Global IME Bank, Global IME Capital, and Jyoti Bikas Bank.\n\nWith his capable and visionary leadership, Nabil Bank is expected to further strengthen its financial position and achieve new milestones across key performance indicators in the days ahead.\n\nThe same board meeting also approved the promotion of Mr. Adarsha Bazgain, Deputy General Manager, to the position of Deputy Chief Executive Officer. In addition, Ms. Vishma Neupane, Chief of the Legal Department, has been entrusted with the responsibility of Company Secretary.\n\nNabil Bank Limited is a pioneer in Nepal’s banking sector, committed to delivering innovative and customer-centric financial solutions. With a strong focus on digital transformation, the Bank continues to redefine banking experiences across the country. Currently, Nabil Bank operates through 268 branches and a network of 320 ATMs nationwide.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Nabil Bank Wins 'The Banker’s Technology Award 2025' for Asia-Pacific",
      "link": "https://www.sharesansar.com/newsdetail/nabil-bank-wins-the-bankers-technology-award-2025-for-asia-pacific-2025-06-05",
      "date": "2025-06-05",
      "summary": null,
      "full_content": "Nabil Bank Limited, one of Nepal’s leading private sector banks, has been honored with‘The Banker’s Technology Award 2025’for the Asia-Pacific region, recognizing its excellence in innovation, digital agility, and technological leadership. Presented byThe Banker, a Financial Times publication, the award highlights the bank’s customer-focused digital transformation and adoption of AI, data analytics, and its nBank app.\n\nActing CEO Manoj Kumar Gyawali stated that the award reflects the bank’s commitment to transforming the banking experience through technology. A digital pioneer since 1984, Nabil Bank introduced Nepal’s first computerized banking system and open banking model. With 268 branches and 320 ATMs nationwide, the bank continues to lead with its customer-centric, tech-driven approach to modern banking.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Commercial Banks Revise Fixed Deposit Rates for Jestha: NIMB Slashes, SANIMA Leads the Hike",
      "link": "https://www.sharesansar.com/newsdetail/commercial-banks-revise-fixed-deposit-rates-for-jestha-nimb-slashes-sanima-leads-the-hike-2025-05-14",
      "date": "2025-05-14",
      "summary": null,
      "full_content": "Commercial banks have published their revised fixed deposit (FD) interest rates for the month of Jestha. While most banks have kept their rates unchanged compared to the previous month of Baisakh, a few have made adjustments.\n\nOut of the 20 commercial banks, 14 banks maintained the same interest rates as in Baisakh, whereas the remaining 6 banks revised their rates, with three banks decreasing and three increasing their rates.\n\nNepal Investment Mega Bank Limited (NIMB) made the steepest cut, reducing its individual fixed deposit rate by 1 percentage point, from 6.50% in Baisakh to 5.50% in Jestha.\n\nSimilarly, Siddhartha Bank Limited (SBL) lowered its rate by 0.25 percentage points, and Kumari Bank Limited (KBL) made a slight decrease of 0.01 percentage points.\n\nAmong the banks that increased individual FD rates, Sanima Bank Limited (SANIMA) led with a rise of 0.38 percentage points.\n\nNepal Bank Limited (NBL) followed with a 0.30 percentage point increase, while Everest Bank Limited (EBL) saw a marginal hike of 0.03 percentage points.\n\nAdditionally, Rastriya Banijya Bank Limited (RBBL) increased its institutional fixed deposit rate by 1 percentage point, from 3.00% to 4.00%.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    }
  ]
}