{
  "symbol": "NABIL",
  "last_updated": "2025-07-18T12:33:12.714298",
  "news": [
    {
      "title": "Nabil Bank to Issue 30 Lakh Units of “7% Nabil Bank Debenture 2089” from Shrawan 6",
      "link": "https://www.investopaper.com/news/nabil-bank-debenture-2089/",
      "date": "July 14, 2025",
      "summary": "Investopaper Nabil Bank Ltd. (NABIL) is going to issue a debenture named “7% Nabil Bank Debenture,",
      "full_content": "Nabil Bank Ltd. (NABIL) is going to issue a debenture named “7% Nabil Bank Debenture, 2089”.\n\nThe debenture offering will open from Shrawan 6, 2082 BS and close on Shrawan 9, 2082 BS.\n\nThe Bank will float 30 lakh units debenture at a face value of Rs 1,000. Hence, the total debenture issue amounts to Rs 3 Arba.\n\nOut of the total issue, the bank will sell 18 lakh units debenture worth Rs. 180 crores through private placement. Likewise, the general public can apply for the remaining 12 lakh units that amount to Rs. 120 crores. Out of the general public’s quota, 5 percent has been reserved for the mutual fund schemes.\n\nFor this purpose, Securities Board of Nepal (SEBON) has given the permission to the company on Ashad 12, 2082 BS. The bank had submitted an application to the board on Ashad 14, 2081 BS seeking permission to issue the debenture.\n\nThe debenture will provide 7 percent interest per annum to the investors. The maturity period of the debenture is 8 years. Hence, the bank will refund the principal amount in 2089 BS.\n\nThe bank has appointed Nepal SBI Merchant Banking Limited the issue and sales manager for the debenture. An agreement has already been reached between the bank and Nepal SBI Merchant Banking in this regard.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/04/nabil-bank.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Balanced Fund-2 (NBF2) Reports Net Asset Value of Rs. 11.51",
      "link": "https://www.investopaper.com/news/nabil-balanced-fund-2-monthly-report/",
      "date": "April 28, 2025",
      "summary": "Investopaper Nabil Balanced Fund-2 (NBF2) has reported a Net Asset Value (NAV) of Rs 11.51 until",
      "full_content": "Nabil Balanced Fund-2 (NBF2) has reported a Net Asset Value (NAV) of Rs 11.51 until the end of Chaitra, 2081 BS. As per the monthly report, the scheme has disclosed a decrease in NAV as compared to the end of the previous month. As of Falgun’s end 2081 BS, the NAV stood at Rs 11.72.\n\nYou May Also Like:\n\nNet Asset Value (NAV) Of Mutual Fund Schemes In Nepal\n\nHow To Buy Mutual Fund Schemes In Nepal?\n\nNBF2 has a total investment value of Rs 94.40 crores in stocks of listed companies. Such investment stood at Rs 95.97 crores in the previous month. Likewise, the scheme has invested Rs 20.10 crores in debenture/bonds and zero amount in fixed deposits. As of the end of Chaitra, NBF2 has a bank balance of Rs 13.30 crores.\n\nIn the first nine month of the current fiscal year 2081/82, NBF2 has posted a gross profit of Rs 16.50 crores. From the fiscal year 2080/81, the scheme has distributed an 8 percent cash dividend to its unit-holders.\n\nNabil Balanced Fund-2 (NBF2) is a close ended-mutual fund scheme operated by the fund manager Nabil Investment Banking Limited under Nabil Mutual Fund. The fund has a size of Rs 1.12 Arba. It has a maturity period of 10 years. The fund will retire on Jestha 16, 2086 BS.\n\nMore From Investopaper:\n\nDividend Announcement By Mutual Funds In Nepal\n\n15 Biggest Mutual Fund Schemes in Nepal",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/10/mutual-fund-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Flexi Cap Fund Reports Decline in NAV in Chaitra",
      "link": "https://www.investopaper.com/news/nabil-flexi-cap-fund-monthly-report/",
      "date": "April 28, 2025",
      "summary": "Investopaper Nabil Flexi Cap Fund has reported a Net Asset Value (NAV) of Rs 11.38 until",
      "full_content": "Nabil Flexi Cap Fund has reported a Net Asset Value (NAV) of Rs 11.38 until the end of Chaitra, 2081 BS. As per the monthly report, the scheme has disclosed an decline in NAV as compared to the end of the previous month. As of Falgun’s end 2081 BS, the NAV stood at Rs 11.67.\n\nYou May Also Like:\n\nNet Asset Value (NAV) Of Mutual Fund Schemes In Nepal\n\nHow To Buy Mutual Fund Schemes In Nepal?\n\nThe mutual fund scheme has a total investment value of Rs 81.57 crores in stocks of listed securities. Such investment stood at Rs 79.24 crores in the previous month. Likewise, the scheme has invested Rs 3.19 crores in debenture/bonds. As of the end of Magh, the scheme has a bank balance of Rs 29.27 crores.\n\nIn the first nine months of the current fiscal year 2081/82, the open-ended scheme has posted a gross profit of Rs. 7.45 crores.\n\nNabil Flexi Cap Fund is an open ended-mutual fund scheme operated by the fund manager Nabil Investment Banking Limited under Nabil Mutual Fund. The fund has a size of Rs 102.21 crores [Chaitra’s End, 2081 BS].\n\nIn an open-ended mutual fund, interested investors can purchase or sell the units of the fund directly from the fund. There is no need to purchase from existing unitholders.\n\nMore From Investopaper:\n\n15 Biggest Mutual Fund Schemes in Nepal\n\nDividend Announcement By Mutual Funds In Nepal",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/09/growth-chart-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Lumbini Ceramics Limited to Float IPO | Appoints Nabil Investment Banking as Issue Manager",
      "link": "https://www.investopaper.com/news/lumbini-ceramics-ipo/",
      "date": "February 4, 2025",
      "summary": "Investopaper Lumbini Ceramics Limited is in the process of issuing shares to the public (IPO). For",
      "full_content": "Lumbini Ceramics Limited is in the process of issuing shares to the public (IPO). For this purpose, the company has appointed Nabil Investment Banking Limited as the issue and sales manager.\n\nThe agreement for public offering was signed between the company and Nabil Investment Banking Limited on this regard. Mr. Shyam Sundar Khetan, Director of Lumbini Ceramics Limited and Manish Narayan Joshi, CEO of Nabil Investment Banking inked the agreement.\n\nNow, the company needs to submit the application to the Securities Board Of Nepal (SEBON). If approved by SEBON, the company can issue the shares to the public.\n\nLumbini Ceramics Limited, incorporated in 2019 as a private limited company, was converted to ‘Public Limited’ company on February 23,  2023. The company is a manufacturer of ‘Glazed Vitrified Tiles’ under the brand name “Laminar”.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo-1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Bank Conducting 40th AGM Today | To Endorse 10 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-bank-agm/",
      "date": "December 12, 2024",
      "summary": "Investopaper Nabil Bank Limited is conducting its 40th Annual General Meeting (AGM) on Mangsir 27, 2081",
      "full_content": "Nabil Bank Limited is conducting its 40th Annual General Meeting (AGM) on Mangsir 27, 2081 BS [December 12, 2024]. The Annual Meeting will take place at Rastriya Sabha Griha, Pardasanimarg, Kathmandu. The AGM will start after 10 AM.\n\nMajor Agendas:\n\nDiscussion and approval of financial reports of the fiscal year 2080/81.\n\nEndorsement of 10 percent dividend to the shareholders.\n\nAppointment of auditor for the fiscal year 2081/82.\n\nDelegation of authority to BOD for any merger/acquisition decisions.\n\nBook Closure Date:\n\nFor the distribution of dividends and AGM purposes, Nabil Bank had fixed the book closure date on Mangsir 10, 2081 BS. The investors purchasing/holding shares of NABIL until Mangsir 9 are eligible for the dividend and can participate in the annual meeting.\n\nRead Related Contents:\n\nDividend History Of Nabil Bank Limited (NABIL)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/04/nabil-bank.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Bank Proposes 10 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-bank-dividend/",
      "date": "October 30, 2024",
      "summary": "Investopaper Nabil Bank Limited (NABIL), one of the leading private sector bank of Nepal, has declared",
      "full_content": "Nabil Bank Limited (NABIL), one of the leading private sector bank of Nepal, has declared the dividend to the shareholders. The dividend announcement is from the fiscal year 2080/81.\n\nThe board of directors meeting held on Karthik 13, 2081 BS has proposed a 10 percent dividend. The dividend will be in the form of cash. The bank has not proposed any bonus share.\n\nAs of Ashad’s end 2081 BS, Nabil Bank has a paid-up capital of Rs 27.05 Arba. At this capital, the cash dividend is worth Rs 2.70 Arba.\n\nThe dividend is subject to approval from Nepal Rastra Bank and the upcoming Annual General Meeting (AGM).\n\nFrom the previous fiscal year 2079/80, Nabil Bank had distributed an 11 percent cash dividend to the shareholders.\n\nRead Related Contents:\n\nDividend History Of Nabil Bank Limited (NABIL)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/04/nabil-bank.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Flexi Cap Fund to Distribute 5 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-flexi-cap-fund-dividend/",
      "date": "September 12, 2024",
      "summary": "Investopaper Nabil Flexi Cap Fund has proposed the dividend to its unit-holders. The dividend announcement is",
      "full_content": "Nabil Flexi Cap Fund has proposed the dividend to its unit-holders. The dividend announcement is from  the fiscal year 2080/81.\n\nNBF2 has declared a 5 percent cash dividend to its unitholders. The board meeting of Nabil Investment Banking Limited held on Bhadra 25, 2081 BS made the announcement about the dividend.\n\nRelated:Nabil Balanced Fund-2 (NBF2) Dividend\n\nNabil Flexi Cap Fund is an open ended-mutual fund scheme operated by the fund manager Nabil Investment Banking Limited under Nabil Mutual Fund. The fund has a size of Rs 62.43 crores [Ashad’s End, 2081 BS].\n\nSuggested Readings:\n\nDividend Announcement By Mutual Funds In Nepal\n\nMutual Funds In Nepal: Every Thing You Need To Know",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/01/DIVIDEND-HISTORY.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Balanced Fund-2 (NBF2) Proposes 8 Percent Dividend",
      "link": "https://www.investopaper.com/news/nabil-balanced-fund-2-dividend/",
      "date": "September 11, 2024",
      "summary": "Investopaper Nabil Balanced Fund-2 (NBF2) has proposed the dividend to its unit-holders. The dividend announcement is",
      "full_content": "Nabil Balanced Fund-2 (NBF2) has proposed the dividend to its unit-holders. The dividend announcement is from  the fiscal year 2080/81.\n\nNBF2 has declared an 8 percent cash dividend that amounts to Rs 8.96 crores. The board meeting of Nabil Investment Banking Limited held on Bhadra 25, 2081 BS made the announcement about the dividend.\n\nRelated:Nabil Equity Fund (NEF) Dividend\n\nFrom the previous fiscal year 2079/80, NBF2 had distributed a 9.6 percent cash dividend to its unitholders that amounted to Rs. 10.75 crores. Similarly, from the fiscal year 2078/79, the scheme had distributed a 7 percent cash dividend worth Rs 7.84 crores. Likewise, in the fiscal year 2077/78, NBF2 had provided a 35 percent cash dividend that amounted to Rs 39.20 crores.\n\nSimilarly, in the fiscal year 2076/77, the mutual fund scheme had distributed a a 9 percent cash dividend worth Rs 10.08 crores.\n\nNabil Balanced Fund-2 is a close-ended equity scheme with the fund size of NPR. 1.12 Arba. The fund has a maturity period of 10 years. It will mature on 16th Jestha, 2086. The scheme was allotted to unit-holders on 17th Jestha 2076.\n\nNabil Investment Banking Limited is the fund manager of the scheme.\n\nSuggested Readings:\n\nDividend Announcement By Mutual Funds In Nepal\n\nMutual Funds In Nepal: Every Thing You Need To Know",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/01/dividend-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nabil Balanced Fund-2 (NBF2) Announces Book Closure Date for Dividend Distribution",
      "link": "https://www.investopaper.com/news/nabil-balanced-fund-2-nbf2-announces-book-closure-date-for-dividend-distribution/",
      "date": "September 11, 2024",
      "summary": "Investopaper Nabil Balanced Fund-2 (NBF2), a close-ended mutual fund scheme operated by Nabil Investment Banking Limited,",
      "full_content": "Nabil Balanced Fund-2 (NBF2), a close-ended mutual fund scheme operated by Nabil Investment Banking Limited, is going to close the unit-holders registration book for the purpose of dividend distribution.\n\nThe fund manager has announced the book closure date on Ashwin 11, 2081 BS. Therefore, investors holding/purchasing units of the scheme until Ashwin 10, 2081 BS will receive the 8 percent cash dividend declared for the fiscal year 2080/81.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/09/BOOK-CLOSE-DATE-800x445.png",
      "source": "Investopaper"
    },
    {
      "title": "Bhugarbha Cement Limited to Float IPO | Appoints Nabil Investment Banking as Issue Manager",
      "link": "https://www.investopaper.com/news/bhugarbha-cement-ipo/",
      "date": "July 1, 2024",
      "summary": "Investopaper Bhugarbha Cement Limited is in the process of issuing shares to the public (IPO). For",
      "full_content": "Bhugarbha Cement Limited is in the process of issuing shares to the public (IPO). For this purpose, the company has appointed Nabil Investment Banking Limited as the issue and sales manager.\n\nThe agreement for public offering was signed between the company and Nabil Investment Banking Limited on this regard. Mr. Deepak Raj Giri, Chief Executive Officer of Bhugarbha Cement Limited and Manish Narayan Joshi, CEO of Nabil Investment Banking inked the agreement.\n\nNow, the company needs to submit the application to the Securities Board Of Nepal (SEBON). If approved by SEBON, the company can issue the shares to the public.\n\nThe company is planning to sell 20 percent of the issued capital of the company in the public offering. The par value of each share is Rs. 100.\n\nBhugarbha Cement Limited currently produces both OPC and PPC cement in the name Bhugarbha (OPC), Apollo, Crystal, Deurali etc. The annual production capacity of the company is 60,000 metric tons of OPC cement and 150,000 metric tons of PPC cement.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo.jpg",
      "source": "Investopaper"
    }
  ]
}