{
  "symbol": "OMPL",
  "last_updated": "2025-07-24T10:09:19.063911",
  "news": [
    {
      "title": "25 MW Seti River Hydropower Project Completed",
      "link": "https://www.investopaper.com/news/seti-river-hydropower-project/",
      "date": "May 11, 2025",
      "summary": "Investopaper The construction of the 25-megawatt Seti River Hydropower Project, located along the Seti River in",
      "full_content": "The construction of the 25-megawatt Seti River Hydropower Project, located along the Seti River in Machhapuchhre Rural Municipality and Pokhara Metropolitan City of Kaski district, has been successfully completed. The project, promoted by Vision Lumbini Energy Company Limited, has now been officially inaugurated and connected to the Nepal Electricity Authority’s grid.\n\nVision Lumbini Energy Company Limited began construction of the project in Bhadra, 2077 BS and completed the project by Kartik 27, 2081 BS.\n\nThe deadline for the project was set for Shrawan 2081 after the extension by a year due to delays caused by the COVID-19 pandemic.\n\nThe project has received investment from 1,500 promoters. The total cost of the project is Rs. 5 billion. About 70 percent of the total cost of the project has been raised from banks and financial institutions and the remaining 30 percent (Rs. 1.5 billion) is being injected through equity. NMB Bank has provided loan financing of Rs. 2.20 billion, Employees Provident Fund Rs. 800 million and Agriculture Development Bank Rs. 500 million in the project.\n\nThe electricity generated from the Seti River Hydropower Project will be connected to the Lahachok substation through a 132 kV 4 km transmission line to the Nepal Electricity Authority’s national transmission line.\n\nSuggested Readings:\n\nList Of Hydro-power Projects With Construction License\n\nHydropower Projects In Nepal (Developed By Private Sector)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/11/transmission-line-substation.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Financial Management for 180 MW Kaligandaki Gorge Hydropower Project Completed",
      "link": "https://www.investopaper.com/news/kaligandaki-gorge-hydropower-project-construction-status/",
      "date": "March 10, 2025",
      "summary": "Investopaper An agreement has been reached for the construction of the 180 MW Kaligandaki Gorge Hydropower",
      "full_content": "An agreement has been reached for the construction of the 180 MW Kaligandaki Gorge Hydropower Project, led by Laxmi Sunrise Bank. The agreement involves a consortium of banks participating in co-financing with Kaligandaki Gorge Hydropower Pvt. Ltd.\n\nThe project is located on the Kaligandaki River in Mustang and Myagdi district. The total cost of the project is estimated at Rs 39.50 billion. The consortium, led by Laxmi Sunrise Bank, has committed to financing 75 percent of the project cost as loan, while the remaining 25 percent will be invested by the company’s promoters and the general public as equity.\n\nLaxmi Sunrise Bank has pledged Rs 9 billion in project financing, with Global IME Bank contributing Rs 7.12 billion, Siddhartha Bank committing Rs 5 billion, Himalayan Bank with Rs 3 billion, Nepal SBI Bank with Rs 3 billion, and Everest Bank with Rs 2.50 billion, totaling Rs 29.62 billion.\n\nThe company received the generation/construction license of the project on Falgun 27, 2075 BS, and signed a power purchase agreement with the Nepal Electricity Authority on Falgun 17, 2079 BS.\n\nThe project’s main promoters include the Sanghai Group, Vishal Group, and Gyanendra Lal Pradhan. Completion of the project is expected by June 2029, with plans to connect approximately 1056 GWh of electricity to the national grid annually.\n\nSuggested Readings:\n\nList Of Hydropower Projects In Nepal (Developed By Private Sector)\n\nList Of Hydro-power Projects With Construction License",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/02/hydropower-dam-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Financial Management for 77.5 MW Ghunsa Khola Hydropower Project Completed",
      "link": "https://www.investopaper.com/news/ghunsa-khola-hydropower-project/",
      "date": "January 27, 2025",
      "summary": "Investopaper Remit Hydro Limited is going to construct a 77.5 MW Ghunsa Khola Hydropower Project in",
      "full_content": "Remit Hydro Limited is going to construct a 77.5 MWGhunsa Khola Hydropower Project in Taplejung.\n\nFor this purpose, the project has secured significant investment from various financial institutions, including Laxmi Sunrise Bank Limited, Hydroelectricity Investment and Development Company Limited, and others, totaling approximately Rs. 12.7 billion.\n\nLaxmi Sunrise Bank Limited will invest Rs. 5 billion, Hydroelectricity Investment and Development Company Limited will invest Rs. 3 billion, Citizen Investment Trust will invest Rs. 2 billion, Machhapuchchhre Bank will invest Rs. 1.45 billion, and Everest Bank will invest Rs. 1.25 billion in the project.\n\nThe total estimated cost of Project is 18.13 billion which will be financed through 70 percent debt and 30 percent equity.\n\nThe Ghunsa Khola Hydropower Project is included in the People’s Hydropower Program. Remit Hydro, the developer of the project, is mainly promoted by Nepal Electricity Authority, Hydroelectricity Investment and Development Company (HIDCL), and Vidyut Utpadan Company.\n\nThe Ghunsa Khola Hydropower Project is a Simple Run off the River (SROR) located in the Phaktanglung Rural Municipality of Taplejung District. The project will generate 458.58 GWh of electricity annually.  The electricity generated from the project will be evacuated through the Dhungesanghu substation.\n\nThe company has obtained the construction license of the project from the Department of Electricity Development on Shrawan 8, 2079 BS. The construction license has a validity until Shrawan 7, 2114 BS.\n\nSuggested Readings:\n\nList Of Hydro-power Projects Under Construction\n\nList Of Hydropower Projects In Nepal (Developed By Private Sector)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/02/hydropower-dam-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Financial Management for 49.95 MW Dana Khola Hydropower Project Completed",
      "link": "https://www.investopaper.com/news/dana-khola-hydropower-project/",
      "date": "January 5, 2025",
      "summary": "Investopaper Lalupate Hydropower Company Pvt. Ltd is going to construct a 49.95 MW Dana Khola Hydropower",
      "full_content": "Lalupate Hydropower Company Pvt. Ltd is going to construct a 49.95 MW Dana Khola Hydropower Project in Manang district.\n\nA financial management agreement has been signed for the 49.95 MW Dana Khola Hydropower Project in Manang. The project will receive a loan investment of Rs. 7.47 billion from six banks, led by Sanima Bank.\n\nThe agreement was signed by Mohan Kumar Dangi, Chairman of Lalupate Hydropower Pvt. Ltd., and Nischal Raj Pandey, CEO of Sanima Bank.\n\nAccording to the agreement, Sanima Bank will provide Rs. 1.97 billion, while Nabil Bank will contribute Rs. 1.5 billion. Additionally, Citizens Bank, Nepal Investment Bank, and Agriculture Development Bank will each lend Rs. 1 billion. HIIDCL and Nepal SBI Bank have also committed to lending Rs. 1 billion each, with only one of them participating in the final loan structure.\n\nThe total loan amount from all banks is expected to reach Rs. 8.47 billion. The total estimated cost of the project is Rs. 9.96 billion, with 75 percent funded by bank loans and the remaining 25 percent (Rs. 2.49 billion) coming from the equity.\n\nThe company received the construction license from the Department of Electricity Developmenton Baisakh 21, 2080 BS. The license has a validity until Baisakh 20, 2115 BS.\n\nThe project is a run-of-the-river (ROR) type project. It will be built on the Dana Khola in Manang.\n\nThe project is estimated to come into operation by Karthik 2084 BS.\n\nSuggested Readings:\n\nList Of Hydro-power Projects Under Construction In Nepal\n\nList Of Hydropower Projects In Nepal (Developed By Private Sector)",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2022/02/hydropower-dam-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Construction of 13.5 MW Kabeli Khola ‘A’ Hydroelectric Project Completed",
      "link": "https://www.investopaper.com/news/super-kabeli-khola-a-hydroelectric-project/",
      "date": "December 1, 2024",
      "summary": "Investopaper The Super Kabeli ‘A’ Hydropower Project, located in the Sirijangha Rural Municipality of Taplejung, has",
      "full_content": "The Super Kabeli ‘A’ Hydropower Project, located in the Sirijangha Rural Municipality of Taplejung, has successfully completed testing and is set to commence commerical electricity generation. With an installed capacity of 13.5 megawatts, this project was constructed at a total cost of approximately Rs. 2.63 billion.\n\nThe testing phase began on last Sunday, and was deemed successful shortly thereafter. Nepal Electricity Authority (NEA) technicians conducted final inspections and are preparing to connect the generated electricity to the national transmission line by the end of the week.\n\nElectricity produced by the Super Kabeli ‘A’ project will be connected to the Amarpur substation in Phidim, which has a capacity of 132 kV. The transmission line from the power station spans approximately 31 kilometers to reach the substation.\n\nThe project was initiated in Mangsir 2079 BS and completed in a remarkably short timeframe. The project is promoted and developed by Snow Rivers Limited. The company received the construction license for the project from the Department of electricity development on Karthik 12, 2078 BS. The construction license has validity until Karthik 11, 2113 BS.\n\nThe project will produce 77.61 GWh of electricity annually-23.42 GWh in dry season and 54.20 GWh in wet season.\n\nSuggested Readings:\n\nList Of Hydropower Projects In Nepal (Developed By Private Sector)\n\nList Of Hydro-power Projects With Construction License",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/02/hydropower-project.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Financial Management for 46 MW Upper Balephi Hydropower Project Completed",
      "link": "https://www.investopaper.com/news/upper-balephi-hydropower-project/",
      "date": "August 18, 2024",
      "summary": "Investopaper A consortium of banks will provide funding for the 46 MW Upper Balephi Hydropower Project",
      "full_content": "A consortium of banks will provide funding for the 46 MW Upper Balephi Hydropower Project in Sindhupalchok’s Jugal Rural Municipality. Led by Laxmi Sunrise Bank, the project will receive a total investment of Rs. 7.07 billion, with participation from Agricultural Development Bank, Nepal SBI Bank, and Machhapuchhre Bank.\n\nThe agreement was signed by officials from the participating banks and Upper Balephi Hydropower Limited during the ceremony.\n\nThe project’s total cost is estimated at Rs. 9.43 billion, 75 percent of which will be financed through loans. On Thursday, a loan agreement was signed in Kathmandu between the banks and Upper Balephi Hydropower Limited.\n\nUnder the agreement, Laxmi Sunrise Bank will provide Rs. 4.07 billion, Agricultural Development Bank Rs. 1.5 billion, Nepal SBI Bank Rs. 1 billion, and Machhapuchhre Bank Rs. 500 million. The remaining investment will be covered by the company’s equity.\n\nUpper Balephi Hydropower Limited received the electricity generation license from the Department of Electricity Development on Shrawan 32, 2078 BS. The construction license has validity until Shrawan 31, 2113 BS. A power purchase agreement with Nepal Electricity Authority was finalized in Mangsir 5, 2080 BS.\n\nOnce operational, the project is expected to generate around 274.89 GWh of electricity annually.\n\nSuggested Readings:\n\nList Of Hydropower Projects In Nepal (Developed By Private Sector)\n\nList Of Hydro-power Projects With Construction License",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/11/hydro-river-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Financial Management for 66.3 MW Middle Kaligandaki Project Completed",
      "link": "https://www.investopaper.com/news/financial-management-for-66-3-mw-middle-kaligandaki-project-completed/",
      "date": "June 23, 2024",
      "summary": "Investopaper Investment has been secured for the 66.3 MW Middle Kaligandaki Hydropower Project, promoted by the",
      "full_content": "Investment has been secured for the 66.3 MW Middle Kaligandaki Hydropower Project, promoted by the IME Group. Various banks and financial institutions, led by Nabil Bank, have agreed to provide Rs. 11.12 billion in co-financing for the project.\n\nOn Friday, during a ceremony in Kathmandu, IME Group’s Hydro Support Pvt. Ltd. and Nabil Bank signed the loan agreement. IME Group Chairman Chandra Prasad Dhakal and Nabil Bank CEO Gyanendra Dhungana signed on behalf of their respective organizations.\n\nThe project, to be built on the Kaligandaki River in Annapurna Rural Municipality of Myagdi District, has a total estimated cost of Rs. 14.84 billion, including interest. The funding will be 75 percent from from loans and 25 percent from equity.\n\nOf the total loan amount, Nabil Bank will contribute Rs. 3.12 billion, Everest Bank and Nepal Investment Mega Bank will each provide Rs. 2 billion, and Nepal Bank, Rastriya Banijya Bank, and Prabhu Bank will each contribute Rs. 1 billion. Additionally, HIDCL will invest another Rs. 1 billion, as per their intent letter. The remaining Rs. 3.71 billion will come from equity, with investments from IME Group and the general public.\n\nAn agreement has been reached with the Nepal Electricity Authority for the sale of electricity. Winter electricity will be sold at Rs. 8.40 per unit, and summer electricity at Rs. 4.80 per unit. The project is expected to produce 130 GWh in winter, generating Rs. 1.09 billion in revenue, and 277 GWh in summer, generating Rs. 1.33 billion. Annually, the project will produce a total of 407 GWh, bringing in Rs. 2.42 billion in revenue.\n\nConstruction is set to begin in October and aims to be completed within four years. Pre-construction activities are currently underway. The project includes constructing a 4.3 km tunnel and an underground powerhouse. The generated electricity will be connected to the Dana substation.\n\nSuggested Readings:\n\nList Of Hydropower Projects In Nepal (Developed By Private Sector)\n\nList Of Hydro-power Projects Under Construction in Nepal",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/11/hydro-river-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "400 kV Hetauda Substation Completed",
      "link": "https://www.investopaper.com/news/400-kv-hetauda-substation-completed/",
      "date": "June 9, 2024",
      "summary": "Investopaper The construction of the 400 kV Hetauda Substation in Thana Bharyang, Hetauda Sub-Metropolitan City-11, Makwanpur,",
      "full_content": "The construction of the 400 kV Hetauda Substation in Thana Bharyang, Hetauda Sub-Metropolitan City-11, Makwanpur, has been completed. This fully automated substation, based on Gas-Insulated System (GIS) technology, is the third largest of its kind in Nepal. It was completed and brought into operation on Friday.\n\nAdditionally, 220 kV and 132/11 kV substations were also charged on the same day in Thana Bharyang as part of the Nepal-India Electricity Transmission and Trade Project.\n\nThe GIS technology substations in Dhalkebar, Inaruwa, and Hetauda, the first, second, and third largest in Nepal respectively, are designed to ensure reliable and high-quality electricity supply from east to west within the country and to facilitate electricity trade with India.\n\nWith the completion of the Hetauda Substation, an infrastructure capable of handling approximately 4,000 MW of electricity has been established. Once the Hetauda-Dhalkebar-Inaruwa 400 kV transmission line project is completed, it will allow the flow of 4,000 MW of electricity. While the Dhalkebar-Inaruwa segment of the project is in its final phase, the Hetauda-Dhalkebar segment is still under construction, hindered by local opposition in wards 15, 16, 17, and 11 of Hetauda Sub-Metropolitan City. Construction continues in areas without obstructions.\n\nThe Hetauda, Dhalkebar, and Inaruwa 400 kV substations were initiated under the National Electricity Development Decade Program with joint investment from the government and the NEA. Construction contracts for the 400 kV and 220/132/11 kV Hetauda substations were signed in December 2018, with an estimated cost of Rs. 3 billion, funded by government and NEA investments along with concessional loans from the World Bank.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/02/substation.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Deposits in Banks Completely Secure: NRB",
      "link": "https://www.investopaper.com/news/deposits-in-banks-completely-secure-nrb/",
      "date": "February 21, 2024",
      "summary": "Investopaper Nepal Rastra Bank, the regulatory authority overseeing the banking sector, has assured the public that",
      "full_content": "No readable content found",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/12/nrb.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Construction Status of Thulo Khola Hydropower Project (21.3 MW): 70 Percent Completed",
      "link": "https://www.investopaper.com/news/thulo-khola-hydropower-project/",
      "date": "December 10, 2023",
      "summary": "Investopaper Thulo Khola Hydropower Project, under construction, in the Raghuganga rural municipality of Myagdi, has witnessed",
      "full_content": "Thulo Khola Hydropower Project, under construction, in the Raghuganga rural municipality of Myagdi, has witnessed the successful breakthrough of headrace tunnel which was 2,700 meters in length.Samyukta Urja Pvt. Ltd is developing the  21.3 MW project in Myagdi district.\n\nThe construction of the tunnel, started from Mangsir, 2078 BS, achieved the breakthrough on Saturday (Mangsir 23, 2080 BS). With this, the project has seen 70 percent of the overall physical progess.\n\nThe project will have a 600 meter penstock tunnel. 495 meters penstock tunnel has been excavated and 50 meters of 100 meters vertical penstock tunnel is left to be dug.\n\nThe estimated cost of the project is Rs. 3.60 Arba. The company plans to complete the construction of the project within next eight months. The electricity generated from this project will be connected to the national transmission line through the 132 KV Rahughat substation being constructed in Raghuganga rural municipality.\n\nFinancial management for the 21.3 MW Thulo Khola Hydropower Project has already been completed. Four banks have invested in the project.Nepal Bank has led the co-financing that amounts to Rs 2.52 Arba. For this, the agreement was signed by Dr. Badri KC, Chairman of Samyukta Urja, and Samata Pant, Acting Deputy Chief Executive Officer of Nepal Bank.\n\nNepal Bank will invest Rs. 75.12 crores, Rastriya Banijya Bank Rs. 66 crores, Siddhartha Bank Rs. 64 crores and Sunrise Bank Rs. 47 crores in the project. The estimated cost of the project is Rs 3.60 Arba. The remaining fund will be injected through equity.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/03/hydro-project-800x445.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Om Megashree Pharmaceuticals Calls AGM on Ashadh 6 With These Agendas; When's the Book Closure?",
      "link": "https://www.sharesansar.com/newsdetail/om-megashree-pharmaceuticals-calls-agm-on-ashadh-6-with-these-agendas-whens-the-book-closure-2025-05-21",
      "date": "2025-05-21",
      "summary": null,
      "full_content": "Om Megashree Pharmaceuticals Limited (OMPL)has called its 9th AGM on 6th Ashadh, 20822. The meeting will be held in the Jugedi, Chitwan, starting at 11 AM that day.\n\nThese are the agendas of the AGM:\n\n1) Endorsement of financial reports for the fiscal year 2080/81.2) Endorse the auditor's report with PL statements, financial reports, and cash flow reports.3) Endorse the appointment of the auditor for the fiscal year 2081/82.4) To form the board of directors.5) To elect 2 boards of directors from the public shareholding group.6) Misc.\n\nJestha 20 is the book closure date. Thus, shareholders who maintained before that day can attend the AGM.\n\nAGM Notice:",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "IPO Shares of Om Megashree Pharmaceuticals Listed In NEPSE; What is the Opening Ranges?",
      "link": "https://www.sharesansar.com/newsdetail/ipo-shares-of-om-megashree-pharmaceuticals-listed-in-nepse-what-is-the-opening-ranges-2025-05-02",
      "date": "2025-05-02",
      "summary": null,
      "full_content": "60,00,000 unit IPO shares ofOm Megashree Pharmaceuticals Limitedhave been listed in NEPSE. This includes the shares held by promoters and the quantity issued to the general public.\n\nThe opening range for the first transaction is Rs. 90.17 to Rs. 270.51. If the company signs an agreement with NEPSE, the IPO shares will be traded in the secondary market the next day.\n\nOut of a total of 60,00,000 unit shares, 18,00,000 units of IPO shares with a par value of Rs 100 were issued to the general public from 27th Falgun- 3rd Chaitra, 2081.\n\nNote that the listed shares will be traded under the symbol'OMPL'.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Om Megashree Pharmaceuticals IPO Allotment Concludes: Lucky 147,600 Applicants Allotted 10 Units Each via Lottery System",
      "link": "https://www.sharesansar.com/newsdetail/om-megashree-pharmaceuticals-ipo-allotment-concludes-lucky-147600-applicants-allotted-10-units-each-via-lottery-system-2025-03-25",
      "date": "2025-03-25",
      "summary": null,
      "full_content": "The IPO allotment ofOm Megashree Pharmaceuticals Limitedis concluded today at the premises of the issue manager Prabhu Capital Limited, Lazimpat, Kathmandu.\n\nOm Megashree Pharmaceuticals Limited had issued 18,00,000 units worth Rs 18 crores as an Initial Public Offering (IPO) to the general public (27th Falgun- 3rd Chaitra, 2081).\n\nOut of 18,00,000 units, 90,000 (i.e., 5% of 18,00,000) were set aside for mutual funds, and 54,000 (i.e., 3% of 18,00,000) units were set aside for the company's employees. The remaining 14,76,000 units were issued to the general public at a par value of Rs. 100.\n\nThe issue received applications from 18,48,298 valid applicants who applied for a total of 2,12,82,420 units. It was oversubscribed more than 14.41 times.\n\nAs per the allotment module, a total of 147,600 applicants were allotted 10 units each via lottery, and the remaining 17,00,698 applicants were returned with empty hands.\n\nIn total, 200,527 applicants who applied for 31,38,150 units were rejected.\n\nAllotment Module:\n\nThe IPO result can be accessed byCDSC IPO Result,MeroShare, andPrabhu Capital\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating a moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "IPO Allotment of Om Megashree Pharmaceuticals To Be Concluded on Tuesday; Lucky 1,47,600 Applicants Will Get 10 Units Each",
      "link": "https://www.sharesansar.com/newsdetail/ipo-allotment-of-om-megashree-pharmaceuticals-to-be-concluded-on-tuesday-lucky-147600-applicants-will-get-10-units-each-2025-03-23",
      "date": "2025-03-23",
      "summary": null,
      "full_content": "The IPO allotment ofOm Megashree Pharmaceuticals Limitedwill take place this Tuesday, i.e., on 12th Chaitra, 2081. The allotment program will be held at the premises of the issue manager Prabhu Capital Limited, Lazimpat.\n\nThe company's issued capital was Rs. 60 Crores, of which 30%, i.e., 18,00,000 unit shares worth Rs. 18 Crores, had been issued later for the general public. Of this public issue, 10% of the shares, totaling 1,80,000 units, had already been issued for Nepalese citizens working abroad. Out of 18,00,000 units, 90,000 (i.e., 5% of 18,00,000) had been set aside for mutual funds, and 54,000 (i.e., 3% of 18,00,000) units had been set aside for the company's employees. The remaining 14,76,000 units were issued to the general public at a par value of Rs. 100.\n\nAccording to CDSC, 19,88,836 applicants have applied for 2,36,91,510 units worth Rs. 2.36 Arba of the closing day.\n\nLooking at the data, it is apparent that only 1,47,600 lucky applicants will get ownership of the company.\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating a moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Om Megashree Pharmaceuticals IPO Closes with 16.05 Times Oversubscription",
      "link": "https://www.sharesansar.com/newsdetail/om-megashree-pharmaceuticals-ipo-closes-with-1605-times-oversubscription-2025-03-17",
      "date": "2025-03-17",
      "summary": null,
      "full_content": "Om Megashree Pharmaceuticals Limitedhad closed the issue of 14,76,000 units of IPO shares yesterday, the 3rd Chaitra, 2081. The issue was opened for the general public on the 27th Falgun, 2081.\n\nThe company's issued capital was Rs. 60 Crores, of which 30%, i.e., 18,00,000 unit shares worth Rs. 18 Crores, had been issued later for the general public. Of this public issue, 10% of the shares, totaling 1,80,000 units, had already been issued for Nepalese citizens working abroad. Out of 18,00,000 units, 90,000 (i.e., 5% of 18,00,000) had been set aside for mutual funds, and 54,000 (i.e., 3% of 18,00,000) units had been set aside for the company's employees. The remaining 14,76,000 units had been for the general public, the issue of which had closed yesterday.\n\nPrabhu Capital Limited is appointed as the issue manager. Applications can be placed for a minimum of 10 units and a maximum of 10,000 units.\n\nAccording to CDSC, 19,88,836 applicants have applied for 2,36,91,510 units worth Rs. 2.36 Arba. Thus, the issue has already been oversubscribed 16.05 times.\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating a moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "IPO Issue of Om Megashree Pharmaceuticals Closing Today; Oversubscribed 13.27 Times So Far",
      "link": "https://www.sharesansar.com/newsdetail/ipo-issue-of-om-megashree-pharmaceuticals-closing-today-oversubscribed-1327-times-so-far-2025-03-16",
      "date": "2025-03-16",
      "summary": null,
      "full_content": "Om Megashree Pharmaceuticals Limitedis closing the issue of 14,76,000 units of IPO shares at a par value of Rs 100 from today, the 3rd Chaitra, 2081. The issue opened for the general public on the 27th Falgun, 2081.\n\nThe company's issued capital is Rs. 60 Crores, of which 30%, i.e., 18,00,000 unit shares worth Rs. 18 Crores, will be issued later for the general public. Of this public issue, 10% of the shares, totaling 1,80,000 units, have already been issued for Nepalese citizens working abroad. Out of 18,00,000 units, 90,000 (i.e., 5% of 18,00,000) have been set aside for mutual funds, and 54,000 (i.e., 3% of 18,00,000) units have been set aside for the company's employees. The remaining 14,76,000 units are for the general public, the issue of which will close from today.\n\nPrabhu Capital Limited is appointed as the issue manager. Applications can be placed for a minimum of 10 units and a maximum of 10,000 units.\n\nAccording to CDSC, 16,18,978 applicants have applied for 1,96,00,430 units worth Rs. 1.96 Arba. Thus, the issue has already been oversubscribed 13.27 times.\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating a moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Om Megashree Pharmaceuticals Opens 14,76,000 IPO Shares for General Public from Today",
      "link": "https://www.sharesansar.com/newsdetail/om-megashree-pharmaceuticals-opens-1476000-ipo-shares-for-general-public-from-today-2025-03-11",
      "date": "2025-03-11",
      "summary": null,
      "full_content": "Om Megashree Pharmaceuticals Limitedis opening the issuance of 14,76,000 unit IPO shares at a par value of Rs. 100, starting today, i.e., 27th Falgun, 2081. The early closing date for this issue is set for 3rd Chaitra, 2081, with a possible extension up to 12th Chaitra, 2081, if it remains unsubscribed.\n\nThe company's issued capital is Rs. 60 Crores, of which 30%, i.e., 18,00,000 unit shares worth Rs. 18 Crores, will be issued later for the general public. Of this public issue, 10% of the shares, totaling 1,80,000 units, have already been issued for Nepalese citizens working abroad. Out of the total 18,00,000 units, 90,000 (i.e., 5% of 18,00,000) have been set aside for mutual funds, and 54,000 (i.e., 3% of 18,00,000) units have been set aside for the company's employees. The remaining 14,76,000 units are for the general public, the issue of which will open from today.\n\nPrabhu Capital Limited is appointed as the issue manager. Applications can be placed for a minimum of 10 units and a maximum of 10,000 units.\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating a moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "IPO for General Public: Om Megashree Pharmaceuticals to Issue 14,76,000 Lakh IPO Shares from Falgun 27",
      "link": "https://www.sharesansar.com/newsdetail/ipo-for-general-public-om-megashree-pharmaceuticals-to-issue-1476000-lakh-ipo-shares-from-falgun-27-2025-03-04",
      "date": "2025-03-04",
      "summary": null,
      "full_content": "Om Megashree Pharmaceuticals Limitedwill issue 14,76,000 unit IPO shares at a par value of Rs. 100 from 27th Falgun, 2081. The early closing date of this issue is on the 3rd Chaitra, 2081, and if the issue is not fully subscribed, it can be extended up to the 12th Chaitra, 2081.\n\nThe company's issued capital is Rs. 60 Crores, of which 30%, i.e., 18,00,000 unit shares worth Rs. 18 Crores, will be issued later for the general public. Of this public issue, 10% of the shares, totaling 1,80,000 unit shares, have already been issued for Nepalese citizens working abroad.\n\nOut of the total 18,00,000 units, 90,000 (i.e., 5% of 18,00,000) have been set aside for mutual funds, and 54,000 (i.e., 3% of 18,00,000) units have been set aside for the employees of the company. The remaining 14,76,000 units are for the general public, the issue of which will open from 27th Falgun, 2081.\n\nPrabhu Capital Limited is appointed as the issue manager. Applications can be placed for a minimum of 10 units and a maximum of 10,000 units.\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating a moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.\n\nOffer Letter:",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Om Megashree Pharmaceuticals Closing 1,80,000 Units IPO Shares to Foreign Nepalese Immigrants From Today",
      "link": "https://www.sharesansar.com/newsdetail/om-megashree-pharmaceuticals-closing-180000-units-ipo-shares-to-foreign-nepalese-immigrants-from-today-2025-02-17",
      "date": "2025-02-17",
      "summary": null,
      "full_content": "Om Megashree Pharmaceuticals Limitedis closing the issue of its IPO for foreign Nepalese Immigrants today, the 5th Falgun, 2081. The issue opened on the 21st Magh, 2081.\n\nThe company's issued capital is Rs. 60 Crores of which 30% i.e. 18,00,000 unit shares worth Rs. 18 Crores will be issued later for the general public. Of this public issue, 10% of the shares totaling 1,80,000 units have been allocated for Nepalese citizens working abroad, the issue of which will close today.\n\nPrabhu Capital Limited has been appointed as the issue manager for the IPO issuance. Applications could be placed for a minimum of 10 units and a maximum of 10,000 units.\n\nAccording to CDSC, 50,234 applicants have applied for a total of 13,34,680 units. Thus, the issue has already been oversubscribed by 7.41 times as of 5 PM yesterday.\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal, promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.\n\nClosing Notice:",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    },
    {
      "title": "Things to Know Before Applying for IPO of Om Megashree Pharmaceuticals; IPO Opens Today For Foreign Nepalese Immigrants",
      "link": "https://www.sharesansar.com/newsdetail/things-to-know-before-applying-for-ipo-of-om-megashree-pharmaceuticals-ipo-opens-today-for-foreign-nepalese-immigrants-2025-02-03",
      "date": "2025-02-03",
      "summary": null,
      "full_content": "Company Profile:\n\nOm Megashree Pharmaceuticals Limited, established on June 12, 2016, is a public limited company in Nepal, promoted by a group of institutional and individual investors. The company manufactures pharmaceutical products at its Chitwan-based plant and began partial operations on February 19, 2024.\n\nAbout the Issue:\n\nOm Megashree Pharmaceuticals Limited has issued its IPO to Nepalese citizens working abroad from the 21st Magh to the 5th Falgun, 2081. Note that the issue will not be extended from the early closing date for Nepalese citizens working abroad.\n\nThe company's issued capital is Rs. 60 Crores, of which 30%, i.e., 18,00,000 unit shares worth Rs. 18 Crores will be issued later for the general public. Of this public issue, 10% of the shares, totaling 1,80,000 unit shares, have been allocated for Nepalese citizens working abroad, the issue of which opened today.\n\nOut of the total 18,00,000 units, 90,000 (i.e. 5% of 18,00,000) have been set aside for mutual funds and 54,000 (i.e. 3% of 18,00,000) units have been set aside for the employees of the company. The remaining 14,76,000 units are for the general public.\n\nFor Nepalese citizens working abroad, the minimum application quantity to be applied is 10 units and the maximum quantity is 10,000 units.\n\nPrabhu Capital Limited has been appointed as the issue manager.\n\nCapital Structure:\n\nShareholding Structures\n\nBoard of Directors\n\nFinancial Highlights:\n\nCARE Ratings:\n\nCARE Ratings Nepal Limited (CRNL) has reaffirmed the ‘CARE-NP BB- (Is)’ rating for Om Megashree Pharmaceuticals Limited (OMPL), indicating moderate default risk for timely financial obligations. Additionally, CRNL has reaffirmed the ‘CARE-NP BB-’ rating for OMPL’s long-term bank facilities and the ‘CARE-NP A4’ rating for its short-term bank facilities.\n\nKey Rating Strengths:\n\nExperienced directors and promoters with prior experience in the pharma industry\n\nSteady demand outlook for pharmaceutical products\n\nKey Rating Weakness:\n\nNotice:",
      "categories": [],
      "image_url": null,
      "source": "Sharesansar"
    }
  ]
}