{
  "symbol": "PPL",
  "last_updated": "2025-07-24T07:41:50.463165",
  "news": [
    {
      "title": "White Lotus Power Limited to Float IPO | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/white-lotus-power-ipo/",
      "date": "July 21, 2025",
      "summary": "Investopaper White Lotus Power Limited is in the process of issuing shares to the public (IPO).",
      "full_content": "White Lotus Power Limited is in the process of issuing shares to the public (IPO). For this purpose, the company has submitted the application to the Securities Board Of Nepal (SEBON) on Ashad 31, 2082 BS. Only after the regulatory body SEBON’s permission, the company can sell the shares to the public.\n\nIf approved by SEBON, the company plans to sell 12.19 lakh unit shares at the par value of Rs. 100 in the public offering. Hence, the public issue amounts to Rs. 12.19 crores.\n\nThe company has appointed Nepal SBI Merchant Banking Limited as the issue and sales manager. The agreement for public offering was signed between the company and Nepal SBI Merchant Banking Limited on this regard. Suman Kumari Joshi, Chairman of White Lotus Power Limited and Lekhnath Pokharel, CEO of Nepal SBI Merchant Banking inked the agreement.\n\nIn the first phase, the company will sell shares to the locals of the project affected areas. Likewise, in the second phase, the hydropower will float shares to the general public, including the employees of the company and the mutual fund schemes.\n\nWhite Lotus Power Limited, incorporated on January 28, 2018, as a private limited company, was transformed into public limited company on September 23, 2021.\n\nThe company is currently developing Hidi Khola Hydropower Project in Lamjung district. The project is a run-of-river type project with an installed capacity of 6.82 MW.\n\nThe estimated cost of the project is Rs. 132.70 crores, which translates into per megawatt cost of Rs. 19.50 crores.\n\nThe major promoters of the company include:\n\n—Kriti Venture Fund Ltd.,\n\n—White Lotus Management Pvt. Ltd.,\n\n—All Bright Holdings Pvt. Ltd.,\n\n—Shikhar Insurance Ltd.,\n\n—Citizen Life Insurance Ltd.,\n\n—Pratap Jung Pandey etc.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/09/hydropower_1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Himalayan Power Partner (HPPL) to Float 2:1 Right Share",
      "link": "https://www.investopaper.com/news/himalayan-power-partner-hppl-21-right-share/",
      "date": "July 14, 2025",
      "summary": "Investopaper Himalayan Power Partner Limited (HPPL) is planning to sell right shares to the shareholders. The",
      "full_content": "Himalayan Power Partner Limited (HPPL) is planning to sell right shares to the shareholders. The company has decided to float the right shares in the ratio 2:1 This means that the shareholders with 100 shares can apply for the additional 50 shares.\n\nFor this purpose, the company has submitted an application to the Securities Board of Nepal (SEBON) on Ashad 24, 2082 BS. Only after the approval from the regulatory body SEBON, the company can issue the shares to the public.\n\nAs of Jestha’s end 2082 BS, HPPL has a paid up capital of Rs. 106.54 crores. Hence, the company has plans to sell right shares worth Rs. 53.27 crores. After the right issue, the paid-up capital will reach Rs. 159.81 crores.\n\nThe company has stated that it will pay the loans taken from BFIs from the proceeds received through right offering.\n\nHimalayan Power Partner is currently operating a 27-MW Dordi Khola Hydropower Project in Lamjung district.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/09/dordikhola-hydropower-project.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Mai Khola Hydropower to Issue 1:1 Right Share | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/mai-khola-hydropower-to-issue-11-right-share/",
      "date": "May 28, 2025",
      "summary": "Investopaper Mai Khola Hydropower Limited (MKHL) is planning to sell right shares to the shareholders. The",
      "full_content": "Mai Khola Hydropower Limited (MKHL) is planning to sell right shares to the shareholders.\n\nThe company has decided to issue right shares in the ratio 1:1. This means that shareholders’ with 100 shares can apply for the additional 100 right shares.\n\nFor this purpose, the company has submitted the application to the Securities Board of Nepal (SEBON) on Jestha 9, 2082 BS seeking permission to float the shares. Only after the approval from the regulatory body SEBON, the company can sell shares to the public.\n\nThe company has already received the approval from Electricity Regulatory Commission (ERC) for the right offering. .\n\nAs of Chaitra’s end 2081 BS, Mai Khola Hydropower has a paid-up capital of Rs. 39.21 crores. Hence, MKHL has plans to float 39.21 lakh shares in the right offering. At a par value of Rs 100, the right issue amounts to Rs 39.21 crores.\n\nAfter the right issue, the paid-up capital will reach Rs. 78.42 crores.\n\nPrabhu Capital Limited is the issue and sales manager for the right offering.\n\nThe company is currently operating a 3 MW Super Mai Cascade Hydropower Project in Illam district.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2021/09/hydropower_1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Myagdi Hydropower to Issue IPO | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/myagdi-hydropower-ipo/",
      "date": "April 18, 2025",
      "summary": "Investopaper Myagdi Hydropower Limited is in the process of issuing shares to the general public (IPO).",
      "full_content": "Myagdi Hydropower Limited is in the process of issuing shares to the general public (IPO). For this purpose, the company has submitted the application to the Securities Board of Nepal (SEBON) on Chaitra 27, 2081 BS. Only after receiving the approval from the regulatory body, the company can float the shares to the public.\n\nIf approved by SEBON, the company has plans to issue 47.45 lakh shares. At a par value of Rs. 100, the public offering amounts to Rs. 47.45 crores.\n\nIn the first phase, the company will issue shares to the locals of the project affected areas and foreign employed Nepalese. Likewise, in the second phase, the hydropower will float shares to the general public, including the employees of the company and the mutual fund schemes.\n\nThe company has appointed NMB Capital Limited as issue and sales manager. The agreement for public offering has already been signed between the company and NMB Capital in this regard.\n\nSimilarly, Citizen Investment Trust is the underwriter for the public offering. The agreement was signed by Bharat Prasad Nepal, Chairman of Myagdi Hydropower Limited and Parbat Bahadur Karki, Managing Director of  Citizen Investment Trust.\n\nMyagdi Hydropower Limited was incorporated on April 18, 2017 as a public limited company.\n\nThe company is currently operating a 14 MW Ghar Khola HPP in Myagdi district since August 25, 2023. The project was completed at a cost of Rs. 3.18 Arba which translates into per megawatt cost of Rs. 22.80 crores.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo-1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Nepal Lube Oil to Issue 1:2 Right Share | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/nepal-lube-oil-to-issue-12-right-share/",
      "date": "April 13, 2025",
      "summary": "Investopaper Nepal Lube Oil Limited (NLO) is planning to sell right shares to the shareholders. The",
      "full_content": "Nepal Lube Oil Limited (NLO) is planning to sell right shares to the shareholders. The company has decided to float the right shares in the ratio 1:2. This means that the shareholders with 100 shares can apply for the additional 200 shares.\n\nFor this purpose, the company has submitted an application to the Securities Board of Nepal (SEBON) on Chaitra 27, 2081 BS seeking approval to issue the shares. Only after the approval from the regulatory body SEBON, the company can float the shares to the public.\n\nAs of Poush’s end 2081 BS, Nepal Lube Oil has a paid up capital of Rs. 7.29 crores. Hence, the company has plans to sell right shares worth Rs. 14.58 crores. After the right issue, the paid-up capital will reach Rs. 21.87 crores.\n\nNIMB Ace Capital is the issue and sales manager for the right offering.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2019/09/right-share.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Aarati Power Company to Float IPO | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/aarati-power-company-ipo/",
      "date": "March 19, 2025",
      "summary": "Investopaper Aarati Power Company Limited is in the process of issuing shares to the public (IPO).",
      "full_content": "Aarati Power Company Limited is in the process of issuing shares to the public (IPO). For this purpose, the company has submitted the application to the Securities Board Of Nepal (SEBON) on Falgun 9, 2081 BS. If approved by SEBON, the hydropower can issue the shares to the public.\n\nThe company plans to sell 36,00,000 unit shares at a par value of Rs. 100 in the public offering. Hence, the public issue amounts to Rs. 36 crores.\n\nIn the first phase, the company will sell shares to the locals of the project affected areas and foreign employed Nepalis. Likewise, in the second phase, the company will float shares to the general public, including the employees of the company and the mutual fund schemes.\n\nThe company has appointed Global IME Capital Limited as the issue and sales manager. The agreement for public offering was signed between the company and Global IME Capital Limited on this regard.\n\nAarati Power Company Limited was established on January 13, 2016. The company is currently developing a 14.5 MW Upper Irkhuwa Khola Hydropower Project in Bhojpur District of Nepal.\n\nThe estimated total cost of the project is Rs. 2.83 Arba which translates into per MW cost of Rs. 19.60 crores. The project is financed in debt equity ratio of 63:37.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2020/02/ipo-1.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Buddha Bhumi Nepal Hydropower to Float 1:1 Right Share | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/buddha-bhumi-nepal-hydropower-right-issue/",
      "date": "February 28, 2025",
      "summary": "Investopaper Buddha Bhumi Nepal Hydropower Company Limited (BNHC) is planning to sell right shares to the",
      "full_content": "Buddha Bhumi Nepal Hydropower Company Limited (BNHC) is planning to sell right shares to the shareholders. The hydropower company has plans to sell the right share in the ratio 1:1. This means that shareholders’ with 100 shares can apply for the additional 100 right shares.\n\nFor this purpose, the company has submitted the application to the Securities Board of Nepal (SEBON) on Falgun 12,2081 BS seeking permission to float the right shares. Only after the approval from the regulatory body SEBON, the company can sell the shares.\n\nAs of Poush’s end 2081 BS, Buddha Bhumi Nepal Hydropower has a paid up capital of Rs. 40 crores. Hence, the company will issue 40 lakh shares that amounts to Rs. 40 crores.\n\nThe hydropower company has appointed NIC Asia Capital Limited as the issue and sales manager. An agreement has been reached between the company and NIC Asia Capital on this regard.\n\nBuddha Bhumi Nepal Hydropower is currently operating a 4.993-MW Lower Tadi Khola Hydropower Project. The project is a run-of-the-river (RoR) project located in the Nuwakot district.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2023/01/securities-board-of-nepal-sebon.jpg",
      "source": "Investopaper"
    },
    {
      "title": "CEDB Holdings (CHDC) to Issue 1:0.545 Right Share | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/cedb-hydropower-right-share/",
      "date": "December 9, 2024",
      "summary": "Investopaper CEDB Holdings Limited (CHDC), formerly known as CEDB Hydropower Development Company Limited, is planning to",
      "full_content": "CEDB Holdings Limited (CHDC), formerly known as CEDB Hydropower Development Company Limited, is planning to sell right shares to the shareholders. The company has decided to float the right shares in the ratio 1:0.545. This means that the shareholders with 100 shares can apply for the additional 54.5 shares.\n\nFor this purpose, the company has submitted an application to the Securities Board of Nepal (SEBON)  on Mangsir 20, 2081 BS. Only after the approval from the regulatory body SEBON, the company can issue the shares.\n\nThe company has appointed Muktinath Capital Limited as the issue and sales manager. An agreement has been reached between the company and Muktinath Capital on this regard.\n\nAs of Karthik’s end 2081 BS, CHDC has a paid up capital of Rs 103.42 crores. The company will issue the right shares on this capital.\n\nHence, the company has plans to sell right shares worth Rs. 56.36 crores. After the right issue, the paid-up capital will reach Rs. 159.78 crores.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2023/01/securities-board-of-nepal-sebon.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Thamel Plaza Hotel and Suites to Issue 10 Lakh Shares in IPO | Application Submitted To SEBON",
      "link": "https://www.investopaper.com/news/thamel-plaza-hotel-and-suites-ipo/",
      "date": "November 21, 2024",
      "summary": "Investopaper Thamel Plaza Hotel and Suites Limited is in the process of issuing shares to the",
      "full_content": "Thamel Plaza Hotel and Suites Limited is in the process of issuing shares to the general public (IPO). For this purpose, the company has submitted the application to the Securities Board of Nepal (SEBON) on Karthik 21, 2081 BS. Only after receiving the approval from the regulatory body, the company can float the shares to the public.\n\nIf approved by SEBON, the company is planning to float 10,00,000 unit shares to the general public. At a par value of Rs 100, the public issue amounts to Rs 10 crores.\n\nThe company has appointed Nepal SBI Merchant Banking Limited as issue and sales manager. The agreement for public offering has already been signed between the company and Nepal SBI Merchant Banking in this regard.\n\nThamel Plaza Hotel and Suites Limited, was incorporated in January 5, 2012 as a private limited company. Later on July 13, 2023, the company was converted into a public company in order to issue the shares the general public.\n\nThe company is operating a four-star hotel under the commercial name of ‘Ramada Encore Kathmandu Thamel’ since January 08, 2021.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2024/11/THAMEL-PLAZA-HOTEL-AND-SUITES.jpg",
      "source": "Investopaper"
    },
    {
      "title": "Champawati Hydropower to Float IPO | Submits Application to SEBON",
      "link": "https://www.investopaper.com/news/champawati-hydropower-ipo/",
      "date": "November 21, 2024",
      "summary": "Investopaper Champawati Hydropower Limited is in the process of issuing shares to the public (IPO). For",
      "full_content": "Champawati Hydropower Limited is in the process of issuing shares to the public (IPO).\n\nFor this purpose, the company has submitted the application to the Securites Board of Nepal (SEBON) on Karthik 4, 2081 BS. Only after receiving the approval from the regulatory body, the company can float the shares to the public.\n\nIf approved by SEBON, the company is planning to float 16,00,000 unit shares at the par value of Rs. 100 in the public offering. Hence, the public issue amounts to Rs. 16 crores.\n\nThe company has appointed RBB Merchant Banking Limited as the issue and sales manager. The agreement for public offering was signed between the company and RBB Merchant Banking Limited on this regard.\n\nElectricity Regulatory Commission (ERC) has already given pre-approval to the company for the IPO issuance.\n\nChampawati Hydropower Limited, incorporated on June 10, 2010 as a private limited company, converted Public Limited Company on February 15, 2022.\n\nThe hydropower company is currently developing Chepe A Hydropower Project District in Gorkha and Lamjung district. The project is a run-of-river type project with an installed capacity of 7 MW.\n\nThe estimated cost of the project is Rs. 132.6 crores, which translates into per MW cost of Rs. 18.9 crores.",
      "categories": [],
      "image_url": "https://www.investopaper.com/wp-content/uploads/2023/01/securities-board-of-nepal-sebon.jpg",
      "source": "Investopaper"
    }
  ]
}